{
    "united.com": {
        "rent a car in Brooklyn - Central, NY on from April 9 to April 15.": 0,
        "Browse check in with confirmation number 123456 for John.": 0,
        "Find deals for Honolulu from New York with budget of $1300 for premium economy.": 0,
        "Find a car to book with miles to pick up on Caldwell (Ohio) on april 8 at 8 am and return on april 13 on noon at the same location": 0,
        "View the bag charges for the passenger James Son for the flight with the confirmation number 10000002": 0,
        "Search for a recent full-time job in United Airlines corporate in Gurugram,  India if a job in sales is available, then apply through email at jacksparrow@gmail.com.": 0,
        "check flight status for a flight from united airlines leaving Belo Horizonte to Buenos Aires on April 9": 0,
        "Calculate the baggage fee for first class flight leaving Columbus CMH to New Orleans MSY on april 9": 0,
        "Book a round-trip flight from Santa Fe, New Mexico to Phoenix, Arizona for 1 adult on August 13th and returning on August 28th.": 0,
        "Find one-way flights from New York to Toronto.": 0,
        "Find popular deals to USA national parks in the southeast region of Biscayne national park, and add to the cart the fully refundable economy flight from New York to Miami with a departure date of May 13 and a return date of May 18.": 0,
        "Find a basic economy flight + hotel for an award travel from las vegas to san francisco leaving and returning on any date on april for 1 traveler and one room": 0,
        "Show me the page with information about Wi-Fi subscriptions.": 0,
        "Book me a flight from BWI to NYC for 2 for August 2nd-August 7th": 0,
        "Search receipt with the eTicket 12345678 for the trip reserved by Jason Two": 0,
        "Find John Atas's trip with the confirmation number 1000001": 0,
        "Search the status of flight from Columbus, number 1234 on April 5th, 2023.": 0,
        "Book a roundtrip on July 1 from Mumbai to London and vice versa on July 5 for two adults and a 12-year-old in premium economy and if a flight is not available, search through the calendar for available flights.": 0,
        "Find a round trip economy flight from Pune to New York in June and select the fully refundable.": 0,
        "Find the TSA Guidelines to travel with Children": 0,
        "Compare the fare types to book a 1-adult ticket from Springfiels, IL to Austin, TX for April 29th 2023": 0,
        "Find the flight schedule between London and New York for April 7 and check the upgrade details of the noon flight.": 0,
        "Request a refund for the traveler Ian Lo and, his document number is 12345678912345 and email ian.lo@gmail.com": 0,
        "Find a round trip from Phoenix to Miami with maximum budget of $2000.": 0,
        "Show me the options for a roundtrip leaving from las vegas on flexile dates on the interactive map": 0,
        "Check in with confirmation number 10987654 for my flight with last name Lewis.": 0,
        "Find one way flights for one person from Sacramento to Houston IAH on June 2, 2023 that can be booked using miles.": 0,
        "Find a vacation package including the cheapest flight, hotel, and car with basic economy fares between New York and Las Vegas from May 16 to May 24, and book 2 rooms for 4 adults in 4 and 5-star hotels with the casino.": 0,
        "Find Hotel in Chicago with lowest price for 2 adults checking in on Apr 14 for 3 days.": 0,
        "Open the baggage fee calculator.": 0
    },
    "ign.com": {
        "Show computer game reviews sorted by score.": 0,
        "Check the rating and user reviews for the game \"Deathloop\".": 0,
        "Find an upcoming game which is releasing in August 2023 for PS5.": 0,
        "Find the initial release date for Guardians of the Galaxy Vol. 3 the movie.": 0,
        "Browse the list of action figure items available for pre order.": 0,
        "Add Uncharted: Legacy of Thieves Collection to my guide and find the Queen's bracelet information.": 0,
        "Find the release date and supported platforms for the game \"Elden Ring.\"": 0,
        "Show popular news which is at number one in comics.": 0,
        "Show me news about the ps5.": 0,
        "Show review of Prometheus movie.": 0,
        "Open the Resident evil 4 game guide.": 0,
        "Find Star Wars The Mandalorian statue and add to cart.": 0,
        "Find a list of all movies that are being released in May 2023": 0,
        "Find the user reviews for the game \"Cyberpunk 2077\"": 0,
        "Find an editor's choice review with a score of 10 in the boardgame category.": 0,
        "Find a walkthrough for the game \"The Legend of Zelda: Breath of the Wild\".": 0,
        "Find games that are availble and  free with ING plus rewards.": 0,
        "Find a walkthrough guide for Assassin's Creed Valhalla.": 0
    },
    "discogs.com": {
        "Find the address and store hours for the Armageddon Shop record store in Boston.": 0,
        "Buy a copy of the Gorillaz first studio album.": 0,
        "Buy a pop rock album CD from the United Kingdom that was released in 2016, is between £15 and £20 and in perfect condition.": 0,
        "Create a new list named New that includes thr\nee albums, one each from the genres pop, rock and electronic.": 0,
        "Find the list of jazz albums released in 1890.": 0,
        "Find vinyl records at the lowest price.": 0,
        "Find the most wanted contemporary Jazz album in the US from the last decade.": 0,
        "Find the name of Depeche mode's latest album and add it to my wantlist.": 0,
        "Open the page with a overview about the submission of releases.": 0,
        "Browse a list of rock vinyls shipped from Germany.": 0,
        "Search for groups about rap and join the second one.": 0,
        "Show me a list of electronic music dvds in very good condition.": 0
    },
    "budget.com": {
        "Find a full-time job in Budget USA in finance in any location, and apply to the latest job.": 0,
        "What is the cheapest luxury car to pickup on the second closest nearby location to New York, United States, 100": 0,
        "Book the cheapest long-term car rental with a fuel plan, GPS, and satellite radio from June 29 to July 28, pick up at 9 am at Orlando airport and dropping off at the same location.": 0,
        "Show brochure of Loss Damage Waiver Protection.": 0,
        "Learn more about the Partner Deal that gives 25% off for Veterans.": 0,
        "Select the mystery vehicle to pick up at Bradenton in Mahattan, Florida  on april 20 at 3 pm and return at 6pm": 0,
        "Book the cheapest cab with GPS and unlimited e-toll, and pay now for an option for a military veteran with pick up from the nearest location to  Nevada City, California, on June 6, 11 am, and drop off at the exact location on June 10, 1 pm.": 0,
        "Find a truck for 10001 zip code on Sunday 11:30 am with flexible dates.": 0,
        "Find the budget price for the vehicle with most seats availible at Roanoke Regional Airport from April 5-6.": 0,
        "View the Emergency Sickness Plan policy certificates for Connecticut.": 0,
        "Find the trip ideas for US travels and book small size or full-size pacific coast highway road trip for a Vietnamese from Los Angeles International Airport on July 7, 1 pm pick up and drop off at the same location on July 15, 2 pm.": 0,
        "Show car guide info for economy car and reserve.": 0,
        "Find a Buick for sale within 250 miles from 26807.": 0,
        "Find the reservation made by James Smith in the United States with Confirmation Number 123456": 0,
        "Find information regarding Fastbreak program.": 0,
        "Search for cars to pick up at the laguardia airport in April 12th, 2023 midnight\n and return to same location at noon": 0,
        "Search for car options to pick up at any location near 10023 on april 12 at 3 am": 0,
        "Rent a 12-inch available moving truck with a complete protection package for approx 250 miles, pick it up at 4:00 pm, and drop it off at the same location on June 20 at 4:30 pm from zip 07718.": 0,
        "Book a SUV rental from Mar 31 (noon) to April 7, 2023 (noon) from Chicago O'hare Intl Airport, ORD and returning to same place with the lowest pay now price.": 0,
        "Get an SUV with an additional driver and wifi for pick up in  any rental location near Washington regional airport on June 1, 11 am, and drop off at Washington international airport on June 2, 11 am, and pay for the booking instantly.": 0,
        "Need the cheapest small car on April 7, 10 am at Auckland airport for pick-up, return will be on April 10 at approx 5 pm.": 0,
        "View a reservation made under the last name Walker in Australia for a car using the reservation confirmation number A987654.": 0,
        "Save two deals and offers for US.": 0,
        "Look for an available full-time job in USA finance, save all the accountant jobs.": 0,
        "Rent a truck with the lowest rent with two dozen furniture pads for 100 miles at zip 08817 on April 12 at 2:30 pm rented truck is to be returned to the exact location and date, and the pickup and drop off will be at the nearest location.": 0,
        "Choose a car which is closest to 10001 New York City for 1 day.": 0,
        "Find only SUVs & Wagons that can be picked up at SFO on April 20, 2023 and returned on April 27, 2023.": 0,
        "Find cars that can be picked up at SFO on April 20, 2023 and returned on April 27, 2023.": 0,
        "Download the e-receipt with the last name Smith and confirmation number X123456989.": 0,
        "Book a Standard SUV to pick up on 10001 on april 10, 2023 for one day": 0,
        "Find and select the car with the most number of seats to pick up in a top airport location in alabama on april 10": 0,
        "Show me the options for vans to rent in Portugal Cove in USD": 0,
        "Find lowest price SUV  for a partner AARP SUV deal discount for pickup Roanoke Regional Airport, ROA Sat, Apr 05, 12:00 PM and drop off on April 10th.": 0,
        "Find the cheapest free SUV upgrade deal with a pay-later option for an Australian for a pick up on June 2, 11 am, and drop off on June 6 at 4:30 pm from Ontario International Airport.": 0
    },
    "resy.com": {
        "Open the photo gallery for Tsiakkos & Charcoal.": 0,
        "Search for restaurants near my location with pizza and for 6 customers.": 0,
        "Make a reservation for 2 guests on april 21 at noon in a restaurant in Austin that is new on resy": 0,
        "Book 3 tickets for a Special Event or Experience in Miami on may 4": 0,
        "Look for a hybrid job at Resy in software development, if the job is open apply immediately.": 0,
        "Show the list of restaurants with reservations available for 04/11 with vegetarian food.": 0,
        "Notify me about availability for 2 guests on april 17 at the High Tide restaurant": 0,
        "Book a table for 3 in Los angeles for diner at 09 PM on Mar 10": 0,
        "Book an outdoor table for 3 people at a Los Angeles restaurant for 5:00 PM on April 7th": 0,
        "What are the Resy Staff Favorites in Seattle?": 0,
        "Find a pasta restaurant in Sydney and save it": 0,
        "Book the tables at Chianti - MG Road restaurant on March 30,1:30 PM for 4 Guests.": 0,
        "Make a reservation for the next restaurant-related event, only 1 ticket is needed.": 0,
        "Find an article about a new restaurant and share it on Twitter": 0,
        "Reserve a dinner table in the first restaurent in the results,  any time after 8 pm tomorrow for two in New York in any available Indian cuisine-serving restaurant.": 0,
        "Show me “pizza” restaurants near Atlanta": 0,
        "Book a table for 2 at a restaurant that was featured on the latest Hit List": 0,
        "Find a Thai restaurant and get notified when they have an open table between 5 to 7 PM": 0,
        "What are the top restaurants in Boston to reserve for april 22?": 0,
        "Find nearby top-rated restaurants in Chicago, save the restaurant, and then book a table for 7 people on April 20 for lunch at 2 pm.": 0,
        "Add my birthday detail, January 5, 1980, and dairy and peanut allergy in my profile, also add love ramen noodles to my bio, and save.": 0,
        "View top-rated new restaurants in Toronto and book a table for two for lunch on April 22, am in any Malaysian restaurant after 9 pm for dinner services.": 0
    },
    "rottentomatoes.com": {
        "Browse certified fresh sci-fi films streaming at home.": 0,
        "Find the US box office revenue for the highest tomatometer rated movie that the actress playing Sam Carpenter in the most recent Scream movie has been in.": 0,
        "Show me the latest news from rotten tomatoes.": 0,
        "Browse movie trailers currently in theaters with \"fresh\" rating.": 0,
        "Find comedy tv shows on netflix sorted by audience score.": 0,
        "Locate the list of movies \"at home\", sorted by most recent.": 0,
        "Find adventure movies coming to theaters.": 0,
        "List upcoming animation and anime movies in theaters": 0,
        "Browse movies in theaters that are certified fresh and sorty by highest audience score.": 0,
        "List pg-13 comedy movies currently in theatres with the highest audience scores": 0,
        "Browse Anime TV shows and sorty by Newest": 0,
        "See what is playing on Showtime sorted by newest.": 0,
        "Find a comedy movie streaming on Netflix and add to watchlist.": 0,
        "Show reviews of top critics for lowest rated Tom Hanks work": 0,
        "List all George Clooney movies and sort them by box office revenue": 0,
        "Find the latest action tv shows which are rated fresh by both the audience and the rotten tomatoes": 0,
        "View all of the Most Popular TV on RT.": 0
    },
    "underarmour.com": {
        "Sign up for the newsletter": 0,
        "Search for newest girls' training  leggings in size yxl and save the top three results.": 0,
        "Find newly arrived Batting Gloves for women": 0,
        "Shop for UA outlet clothing and find a outdoor sports jacket in size ymd.": 0,
        "find the Under Armour Return Policy for Men's UA Football All Over Print Metal Logo Short Sleeve": 0,
        "Search for women's golf polos in m size, priced between 50 to 75 dollars, and save the lowest priced among results.": 0,
        "Find a men's UA outlet T-shirt of XL size and add to cart.": 0,
        "Find men's running shoes of size 9 with lowest price and add to bag.": 0,
        "Filter women's sports bras that are purple  with high support that are small size.": 0,
        "Find the price of Boys' INFANT UA SURGE 3 RUNNING SHOES. black color and 9K size": 0,
        "Browse for trending women sports bras and add 3 trending black bras to Wishlist.": 0,
        "Find the Mens size guide for bottoms": 0,
        "Search the cheapest Curry brand unisex athletic shoes with the number 5.5, add to cart and checkout.": 0,
        "Add a e-gift card to bag of $100 for recipient John and email address abc@test.com from buckeye.foobar@gmail.com with message gift card.": 0,
        "Add five of red 50-dollar gift carts to the cart, during checkout, check if coupon 100OFF is working or not.": 0,
        "Locate a store in New York 10007 and view store timings.": 0
    },
    "kayak.com": {
        "Get the hotel with highest review score having free internet and free cancelation in Chennai for 20/03/23": 0,
        "Find a hotel with 4 star and above rating in Los Angeles for 3 days next week and save it.": 0,
        "Get the cheapest direct flight from Madurai to Chennai on 20/3/23 booking through Air India.com": 0,
        "Find the fastest single stop flight fron JFK airport in New York to Male in Maldives on March 13": 0,
        "Find the cheapest Hawaii package for two adults from June 18 to 21, and the hotel must be near a beach, have a beachfront, hot tub, and pool, and provides towels.": 0,
        "Find hotels in Las Vegas, NV that offer free airport shuttle service.": 0,
        "Browse for places to stay in Santa Fe, New Mexico for a weekend starting on Jun 16th for 3 guests and 2 rooms.": 0,
        "check cheap flights from NYC to London on 23rd of April for students over 18 years.": 0,
        "Search for rental cars in Seattle, WA and filter the results by the Best score.": 0,
        "Find the quickest one-way flight from New York To Paris on June 4 for two adults with one carry-on and one check-in bag in business class.": 0,
        "Find vacation packages to Hawaii.": 0,
        "Search for the cheapest two rooms near Kashi Vishwanath Temple in India for three adults and a 7-year-old kid from June 6 to 10 in any 3-star and up air-conditioned family hotel with a review score of at least 8, free internet.": 0,
        "Search for a rental car in Miami, FL for pick up at the airport and drop off at a different location within the same city.": 0,
        "book the cheapest hotel in Le maraise neighborhood in paris with 2 room for 3 adult on March 27th to April 2nd.": 0,
        "Search for flights from New York City to London and filter the results to show only non-stop flights.": 0,
        "Find a cheapest one way flight from Mumbai to Dubai on 24 May.": 0,
        "search four door SUVs from Avis while traveling from New Orleans, L, to New York that isn't more than $1000 in total price from Mar 25th to Apr 1st, pickup at 2PM.": 0,
        "Find a cheapest SUV in Brooklyn for 1 day.": 0,
        "From Birmingham (BHX) to Paris search for packages with casinos, restaurant, fitness and a free internet from April 7th to 11th.": 0,
        "Check travel restrictions when traveling from US to Cambodia.": 0,
        "search the cheapest small car rental deals from Little Ferry, New Jersey, United States on 23th March to same location dropoff on april 4th 2pm.": 0,
        "Track flight with number D145 of Qatar Airways on April 18t\nh.": 0,
        "Browse medium cars for rent for a week in Las Vegas starting on Jun 5.": 0,
        "Book the lowest-priced train or bus from Alexandria, Washington to Penn Station, New York, on May 3 for a single traveler.": 0,
        "Look up round trip flights for 1 person to Japan at the Narita airport departing on 6/16 and returning on 6/23.": 0
    },
    "sports.yahoo.com": {
        "Find the standings for the English Premier League.": 0,
        "Show me the NFL passing touchdown season stats.": 0,
        "Show me the page with download options for fantasy apps.": 0,
        "Search for the latest news and rumors about the NBA team the Los Angeles Lakers.": 0,
        "check the current standings for the western conference in the NBA and find the top team.": 0,
        "search for news about the latest news about Lebron James' injury and share the article on twitter.": 0,
        "Find the Leaderboard for the top 10 fantasy Basketball players for the Rotisserie challenge.": 0,
        "Open the news page with the UFC schedule.": 0,
        "Find the current injuries of Phoenix Suns players.": 0,
        "Search for upcoming MLB games taking place on Sunday, 3/19.": 0,
        "Find the NBA team with the best odds to win the NBA title.": 0,
        "find the score of the latest nfl game played by the las vegas raiders.": 0,
        "find the score of the latest nba game played by the phoenix suns.": 0,
        "Find the results of the most recent NFL games.": 0,
        "Find the list of injured NBA players.": 0,
        "Follow the Denver Nuggets NBA team.": 0,
        "Find the current roster of the Miami Heat.": 0,
        "Find the last game of the season for the Toronto Raptors.": 0
    },
    "spothero.com": {
        "Find a parking with EV charging for month with lowest price in Chicago.": 0,
        "Find an hourly parking in New York City of lowest price.": 0,
        "Find a parking spot near Dallas Love Field Airport.": 0,
        "What are the  parking options in Florida to book to enter on may 6 at 5 pm and leave the same day at 6pm?": 0,
        "Find parking in New York City by month on July 5th start date.": 0,
        "Find Wheelchair accessible parking for April 09 event in Barclays Center that allows entry after 10am": 0,
        "Find career openings in the marketing department": 0,
        "View details for a Times Square parking lot that is wheelchair accessible.": 0,
        "Find EV charging supported parking closest to Smithsonian museum on Apr 9 between 9am to 6pm": 0,
        "Find the cheapest wheelchair accessible parking for the Pittsburgh Pirates at St. Louis Cardinals event in Busch Stadium on Apr 13.": 0,
        "Search and book the cheapest daytime only monthly parking option in Seattle near Stripe, 5th Avenue": 0,
        "Book an hourly parking at Atlanta International Airport.": 0,
        "Find parking spaces in JFK airport between April 18-20 that have lowest shuttle times": 0,
        "Book the closest parking spot to the Orlando Magic at Brooklyn Nets event, happening in Barclays Center, to enter after 3 pm and exit after 5 pm": 0,
        "Sell my parking space in Houston. Name: James Smith, Email: buckeye.foobar@gmail.com, phone: 8888888888. Address: 123rd st.": 0,
        "Search for a parking near any airport in california starting april 20 and ending april 23": 0,
        "Find guide for paying with commuter benefits.": 0,
        "Find a parking near any NBA arena to enter today after 5 pm and exit after 8 pm": 0,
        "Find monthly daytime only parking nearest to Madison Square Garden starting from April 22": 0,
        "Find a monthly parking with valet service at the New York University.": 0,
        "Show the details for a monthly parking option in Ney York City near Street Taco to start on may 6 that i can self park": 0,
        "Book the cheapest parking spot near Bradley Airport": 0,
        "Contact the support service.": 0,
        "Search for Monthly Parking Starting april 12 near Florida Keys": 0
    },
    "imdb.com": {
        "Search the  actor who won the Oscars for best actor  in a suuporing role ine 1990, and add his upcoming movies to my watchlist.": 0,
        "Edit my movie watchlist.": 0,
        "Find The Last of Us series and add it to my watch list.": 0,
        "Give me the IMDB recommendations of what to watch.": 0,
        "Show me a list of comedy movies, sorted by user ratings.": 0,
        "Play Trailer of \"The Flash\" 2023.": 0,
        "Play a star wars movie trailer.": 0,
        "Add the second most popular horror series to my watchlist.": 0,
        "Find videos from the Oscar 2023.": 0,
        "Find the list of critic reviews for the movie Creed III.": 0,
        "Find superhero sci-fi movies based on comic books rated 7 to 9, and add the three movies with the most votes to my watchlist.": 0,
        "What are Jerry Trainor's upcoming projects?": 0,
        "Add Prometheus movie to watchlist.": 0,
        "Add documentary  \"The Elephant Whisperers\" and \"The Magician's Elephant\" to the watchlist.": 0,
        "Show me movies produced by Aaron Horvath.": 0,
        "Find the movie which won the jury prize in Cannes 2022, add the director of the movie to the new list named director and add \"to watch\" in the description of that list.": 0,
        "Get the most popular documentary tv series sorted by IMDB rating, see the details of the top result.": 0,
        "Show top 50 Movies and TV shows by Sci fi genre.": 0,
        "Find the movie Donnie Darko and show its complete cast.": 0,
        "Browse the list of top 250 movies and add the first one to my watchlist.": 0,
        "Give a 10 rating to The Terminator II: Judgement Day.": 0,
        "Show crazy credits for the movie \" Prometheus\".": 0,
        "Find the most popular movies and showcase those with the highest IMDb ratings.": 0
    },
    "bookdepository.com": {
        "Check all English Reading and Writing skills Educational Books for Ages 6-8 currently in stock that are available in hardback under 20$.": 0,
        "Find a book in Hindi with ISBN 1648926800.": 0,
        "Show status of my order with order number X123456789 and email buckeye.foobar@gmail.com": 0,
        "check the most popular Spanish recipe book available in paperback that are in stock.": 0,
        "Search for Romantic Audio fiction books with the lowest price.": 0,
        "Search for a non-fiction children's book for ages 9-11 on the topic of history in the Hindi language, and add the top book to the cart, if not available choose notify me option and also add the book to new wishlist must buy.": 0,
        "Browse bestsellers under $20 and available in hardback.": 0,
        "Find the latest medical audiobook on complementary medicine for under 20 dollars and add the top book to the cart.": 0,
        "Add a harry potter book to my wishlist.": 0,
        "Add a Medical book related to Diseases & Disorders to basket.": 0,
        "Show books of Dr Seuss with price range of $20 to $40 and add 2 to basket.": 0,
        "search new books from Jk Rowling available for kids within the age from 3 to 5 that are below $20": 0,
        "Browse fiction audio books sorted by lowest price.": 0,
        "Check the French best sellers under $40 available in digital that are currently in stock.": 0,
        "Cancel an order with order number X123456 of Harry Potter Box Set as not available at address.": 0,
        "Find the latest Game of Thrones toys  for English speakers and add the top two  result to the cart and checkout.": 0,
        "Browse books by author Stephen King in German.": 0
    },
    "qatarairways.com": {
        "Retrieve booking for 123456 last name Smith.": 0,
        "Explore Durban in Africa and book a flight from Doha for 2 adults and 1 infant, on May 28, book the first flight in economy comfort.": 0,
        "Compare all membership tier benefits.": 0,
        "Retrieve booking 1234567890 booked by Jason Smith": 0,
        "Book a best business class flight ticket from Colombo to New York with a two-day Qatar stopover for 2 adults and 1 child on June 24.": 0,
        "Show me the list of one-way flights today (April 17) from Chicago to Paris.": 0,
        "Find information about baggage allowance for business class.": 0,
        "Search for a job in customer services in Qatar Airways, find any job available in India, view the details and save the job.": 0,
        "Find a one-way flight ticket from Addis Ababa to Accra on April 14 and book the cheaper economy ticket.": 0,
        "Check the status of my upcoming trip with booking number 123456789 and last name Smith.": 0,
        "Find the status of flights between Abidjan and Accra.": 0,
        "Find a hotel in Las Vegas that will cost two people the least for a week starting from 10, April": 0,
        "Reserve the cheapest hotel with 5 stars and free wifi located in downtown dc in Washington on June 5 for 4 adults in 2 rooms.": 0,
        "Check travel requirements for trips between Tokyo and Guangzhou.": 0,
        "On April 21, look up a flight from Mumbai to Stockholm.": 0,
        "Find travel requirements from Amsterdam to Cairo.": 0,
        "Find the weight of baggage allowance for economy class on a flight from Japan to Iran.": 0
    },
    "ikea.com": {
        "Open the design tool for a new home office.": 0,
        "Add decorative LED Candles to the cart.": 0,
        "Find wall mirrors for under $20.": 0,
        "Find the cheapest set of stainless steel spoons, which are available in stock in San Diego, California.": 0,
        "Find a Queen size memory foam mattress with lowest price.": 0,
        "Find the lowest-priced gray-colored round-shaped mirror in stock in Atlanta, Georgia, with a maximum price of 20 dollars.": 0,
        "Show offers on home essentials under $20 and add the first 3 items to favorites.": 0,
        "Find spare parts with part number 105307 and add 2 of them to cart.": 0,
        "Browse candle holder red decor products.": 0,
        "Go to limited-time offers and choose the cheapest outdoor dining table, add to the cart, and checkout as a guest and select Ikea West Chester store for pick-up.": 0,
        "Find plastic bathroom baskets that are gray from low to high prices near zip code 60173.": 0,
        "Find a store near 11231 zip code.": 0,
        "Find a store in Tempe, Arizona,  make it my store, and then visit the store page and see whats happening in store.": 0,
        "Find a bedroom nightstand made from solid wood and compare the top three highest-rated products, and show only the differences.": 0
    },
    "last.fm.com": {
        "Find the all time most popular solo track by ArianaGrande": 0,
        "Find the weekly chart-topper artist and play the number 1 track of that artist after liking the track.": 0,
        "Show Jazz music genre albums and tracks.": 0,
        "Give a like to the #1 track of the Real Time Top Chart": 0,
        "Play the top track for the top indie artist in the last 30 days": 0,
        "Show my Library and sort by Albums.": 0,
        "Create a playlist and name it \"Dirty\" and add 5 Doja Cat songs.": 0,
        "Find the soonest upcoming event near zip code 90028.": 0,
        "Search for the artist profile of M S Subbulakshmi and play all from the top tracks.": 0,
        "Find similar artists to the Weekend.": 0,
        "Favorite the top rock track": 0,
        "Find a woman t-shirt in xl size from merchandise section, add 2 pieces to the cart and check out.": 0,
        "Set the 3rd top hip hop track as my current obsession": 0,
        "Discover Katy Perry and add bookmark to it and view all tracks.": 0,
        "Find the most popular song this week by the no. 1 weekly charts ranked artist": 0,
        "Find events starting from April 1, 2023 within 100 miles of New York and see who are going in the top listed event and follow all of them who are going.": 0,
        "Find the top rated indie rock music track and set the track as current obsession and after that watch all other obsessions too.": 0,
        "Find the top number one track by the artist \"Alan Tam\" of all time.": 0,
        "Set the first recommended song on the homepage as a current obsession": 0,
        "Play spiking track which is at number 1.": 0,
        "Share a Blackpink event on Twitter.": 0
    },
    "sixflags.com": {
        "Buy a single day pass to Six Flags, Magic Mountain.": 0,
        "Find the Saturday park hours for Six Flags, Magic Mountain.": 0,
        "Show me the map of a Six flags park in mexico": 0,
        "Show me all the events at any six flags park in Texas": 0,
        "Show me the gift shops available at a park in New York": 0,
        "Show the balance sheet and cash flow statement for the fiscal year 2021 of Six Flags.": 0,
        "Browse the season pass prices for  Hurricane HarborLos Angeles.": 0,
        "Request information for tickets for a group of 100 people at a park in california": 0,
        "Purchase a one meal season dining pass for the Six flags great america": 0,
        "What are the St louis park policies regarding security?": 0,
        "Buy tickets for a group at Hurricane harbor Phoenix on April 22": 0,
        "Sign up for emails using the name Dick Smith and the email smith@gmail.com, select Six Flags Magic Mountain as the Park of Preference,": 0,
        "Buy a birthday party package for a group of 10 at Arizona park with my address details. Group name is Neo, group leader's name is Thomas Anderson, birthday is May 5th, 1995. The phone number is2526545258. The email address is thomas.neo@gmail.com and address is po box 2846, Texas city in the state of Texas.": 0,
        "Confirm my vip tour at the six flags Discovery Kingdom": 0,
        "Buy a group ticket for 20 people in Six Flags Magic Mountain in Los Angeles on Apr 30, add 5 mega meal deals with it. Name the group Crew and check out as James Johnson, james.john@gmail.com. It is a family trip organized by Johnson.": 0,
        "Buy a diamond pass in New York's, Great escape park, add one meal dining plan to it, and select the flexible payment plan for Jame Jones. The email address is jame_jones@hotmail.com, zip code 10005 and age is 35.": 0,
        "Find a place to stay near Great Escape New Park from April 21 to April 24 for 2 adults and 1 kid, and book the cheapest themed room.": 0,
        "Apply for a job on the Six Flags White Water park": 0,
        "What are the family rides available at frontier city?": 0,
        "Add two Maryla\nnd park all-season go-cart passes add-on in the cart, and choose the digital ticket option.": 0,
        "Find thrill rides in Six Flags Great America, Chicago, IL.": 0,
        "Find me the deals available for the Great escape park": 0
    },
    "tesla.com": {
        "Find a red used tesla Model S.": 0,
        "Schedule a virtual consultation for Solar Roof. The name is James  Smith. The address is 123 st rd. The emial address is abc@abc.com": 0,
        "What is the purchase price for powerwalls to install in a 200sqr feet 2 story house in the address 7528 East Mechanic Ave.Fargo, ND 58102": 0,
        "Find me the cheapest red Model Y available to register in 94043": 0,
        "Open the page to schedule a Model X test drive.": 0,
        "Show me a map with charging stations in London.": 0,
        "View inventory of Tesla Model S that are blue and new with 19\" wheels within 50 miles of zip code 60602.": 0,
        "Show me the best seller accessories for the Model X": 0,
        "Add a Tesla Shop Gift Card for April May with the email april.may@gmail.com to my cart": 0,
        "Show me the inventory of the Tesla Model S within 200 miles from 10001": 0,
        "Go to the page with help in choosing a solar energy product for homes.": 0,
        "Schedule a demo drive for Model Y for Roy Adams with phone number 123-999-0000, email address RA@gmail.com and zip code 90001 in the United States.": 0,
        "Check the price of Tesla Model Y Performance for the 10001 zip code.": 0,
        "Browse the used inventory of the Model Y with performance all-wheel drive.": 0
    },
    "rentalcars.com": {
        "Hire a premium luxury car closest to North Las Vegas on April 29 at 6 pm and drop it off at the same location and the same day at 11 pm, supplier should be Avis if available.": 0,
        "Find cheapest cars available at San Francisco Airport for a day.": 0,
        "Search for Premium Cars available to rent at LondonHeathrow Airport.": 0,
        "Choose a lowest priced hybrid SUV car to pick up from Bangkok downtown on May 24 at 9:30 am and drop off on May 28, at 9 am.": 0,
        "Check if cars are available for tomorrow at Elevated Escape in North Carolina.": 0,
        "Find a SUV with automatic transmission in New York drop off at March 30.": 0,
        "Find a premium 4-door car with automatic transmission and unlimited mileage at Heathrow Airport for pickup, on date April 26, 2 pm, and drop off at the same Airport on April 30, 1 pm, book a range rover if available with full protection.": 0,
        "Check prices for luxury sedan car in Houston with insurance.": 0,
        "Find a large car with lowest price from Mar 28 to Apr 1 in Zurich.": 0,
        "Find a car to rent in Detroit, MI for pick up on April 2 and drop-off on April 3, both at 11AM, only show cars from Enterprise and Avis": 0,
        "Rent a small air-conditioned car with collision damage coverage from the Liverpool Airport car rental center for pick-up on May 5, 11:30 am, and drop-off on May 7, 11 am.": 0,
        "Get cheapest medium car with like for like fuel policy from the Boston airport shuttle at 4 pm on April 16th and drop it off the next day at 3:30 pm,if booking is not available on that day, move the booking a day further and try to book again\n.": 0
    },
    "soundcloud.com": {
        "Repost on my feed a rock playlist.": 0,
        "Follow an artist from the chill category.": 0,
        "Compare Pro Plans with other plans available.": 0,
        "Find popular tracks from the rock band Nirvana.": 0,
        "Find artist Mark Knight from London and follow him and add his most liked track to next up.": 0,
        "Find a south african history podcast with length between 10 to 30 minutes and filter it by audiobook tag.": 0,
        "Browse the top 50 hip hop chart and play the top track, then add this track to a newly created private playlist named Top Hip Hop.": 0,
        "Make a playlist and add 3 songs from popular Selena Gomez tracks and name it Love.": 0,
        "Follow Taylor Swift and add a playlist to next up.": 0,
        "Delete the history of what i heard recently.": 0,
        "Like a game mix album.": 0,
        "Find a Ricky Kej track to listen and share which has been added in the last year and is between 2 to 10 minutes.": 0,
        "Open my likes list.": 0,
        "Explore the trending playlists,filter by tag #Electronics, play Countdown by Adrien Brunelat and like it.": 0,
        "Find an Indian classical track longer than 30 minutes which has been added in the past month and add to playlist named Meditation Music, if playlist not found create one.": 0,
        "Search for the playlists \"Pop Workout mix\" and filtered by tag #Dance & edm.": 0
    },
    "cargurus.com": {
        "calculate a car loan payment for a $25000 car with a $5000 down payment and 12 percent interest rate for 48 months.": 0,
        "Check the lowest price for a white 2017 certified pre owned Lexus Rx350 near 90012.": 0,
        "Find used BMW i3 for 10001 zip code with lowest price.": 0,
        "Show all used Tesla cars for 10017 zip code.": 0,
        "Find the newest silver-colored Lexus SUV with a black interior and backup camera to purchase which has been made between 2022-2023 and is within 50 miles of zip 10017.": 0,
        "See the price trends of used Tesla cars from August 1, 2022, to January 31, 2023, and compare the trend with the Cargurus index.": 0,
        "Browse listings for a used Toyota Corolla near 10019 and sort by cheapest.": 0,
        "Calculate monthly payment for car value of $50,000 and downpayment of $10,000 with interest rate of 4% for 60 months.": 0,
        "Check reviews and research information about Audi A6 2020.": 0,
        "Get offer to sell car with AZ XA1234 number plate from Arizona state.": 0,
        "Look for a job opening in sales in San Fransisco, and if found, apply for the job.": 0,
        "Search for a certified pre-owned front-wheel drive Jeep, Compass model car with single owner and  the lowest mileage within 500 miles of zip 59316.": 0,
        "Get prequalified with a good credit score for a $30000 car with a $6000 down payment for 48 months.": 0,
        "Sell my single-key black car, which has no defect with a leather interior through Louisiana, license plate number YAW639 in zip 70726 with mileage of 222900, get the offer at my email sellmycar@mail.com.": 0,
        "find offer for a black Honda with vin number 1HGCM66543A064159 with 155000 millage near 49102. The car should be in good condition with no damage, 2+ keys and paid off.": 0,
        "Search for the lowest millage used Honda Crosstour 2012 to 2013 near 49102 less than $25000.": 0
    },
    "uniqlo.com": {
        "Add to my cart a women's T-shirt priced under 10 dollars": 0,
        "Find Mens orange color Jacket and parkas with L  Size and add to cart": 0,
        "See in the Men's sale if any L-sized t-shirt in blue color is available or not, if available, add one to the cart choose pick in store for zip 10005.": 0,
        "Find a wireless bra in size xxs or  s, add one brown and one purple color to the cart and view the total cart value.": 0,
        "Find a Women's t-shirt for $40-$60 and add it to Wishlist, stop at the Login screen.": 0,
        "Locate a large store in Washington that has kids' and maternity products, also check if they have a parking lot, and see the directions of the nearest store.": 0,
        "Search for Limited Time Offers available in the Kids section and filter by size, 11-12Y(150).": 0,
        "Show all the women cropped tops with lowest price first.": 0,
        "Search for women's sports wear, size S.": 0,
        "Find kids 13Y size t shirts and add 3 to cart.": 0,
        "View the toddler collection and add one pair of the cheapest socks for a 6 months to 5 years to the wishlist.": 0,
        "Find yellow t-shirts for women small size that are less than $20.": 0,
        "Locate a store which is nearest to 10017 zip code.": 0,
        "locate the store in IL": 0,
        "Add one baby one piece to cart.": 0,
        "Add two pairs of women's Pink sweet pants in XXL size to your cart and view your cart.": 0,
        "Find all Uniqlo's located in Chicago, IL.": 0,
        "Show me the list of baby products that are on sale and under 10 dollars.": 0,
        "Find a black blazer for men with L size and add to wishlist.": 0,
        "Find the new arrival of kids graphic t-shirt for 13 years old boy": 0,
        "Show me the list of Men's Blazers, Black, Size M.": 0,
        "Find black shorts in XXL or 3XL sizes for sale under men department, add the top product to the cart.": 0,
        "Find the page with instructions on how to return orders online.": 0
    },
    "foxsports.com": {
        "Browse recent NFL-related videos.": 0,
        "Find the Chicago Bulls team schedule for the month of April.": 0,
        "Check all Bayern Munich goalie stats": 0,
        "Check Real Madrid player Vinicius Junior bio": 0,
        "check the winning odds in the Champions League for Real Madrid against Chelsea.": 0,
        "Browse the most recent NASCAR driver news.": 0,
        "check the scores of the premiership on 19th of March.": 0,
        "Find bio information about Lebron James.": 0,
        "Find the odds for upcoming NHL matches.": 0,
        "Open the NFL Passing yards players stats.": 0,
        "Show me the scores of today's NBA games.": 0,
        "Add formula 1 to my followed sports.": 0,
        "add WWE superstar ALIYAH to your favorite by following her.": 0,
        "Search the latest story about NFL  and share it on facebook.": 0,
        "Check the current standings for MLS.": 0,
        "Find the schedule for upcoming MLB games for the New York Yankees.": 0
    },
    "gamestop.com": {
        "Buy a $25 digital gift card for Tim Stebee, whose email address is scisoorbros@gmail.com. Fill in sender name Jeerimiah Waton": 0,
        "find kinect camera for xbox one.": 0,
        "Show me RPG video games.": 0,
        "Find a low-priced refurbished Microsoft Xbox one console in white color and available in stock.": 0,
        "Search for the latest deluxe digital copy of the Xbox Series X Resident Evil game for pre-order and add it to the cart.": 0,
        "find Playstation gift card of $10.": 0,
        "Look for a recently posted part-time Job in Gamestop stores in Fresno, California, and apply.": 0,
        "Find the cheapest educational trade-in Nintendo switch game rated for everyone, and print the details.": 0,
        "Add a NBA basketball game for the PS5 to the shoping cart": 0,
        "find Panini Diamond Kings Baseball cards set below $25.": 0,
        "Add two $50 playstation store gift cards to cart": 0,
        "Check the trade-in value for Call of Duty: Black Ops III for Xbox One.": 0,
        "Find used Xbox series X available.": 0,
        "List Batman collectible figures priced under 10 dollars and a customer rating above 4 with a same-day delivery option.": 0,
        "find the cheapest xbox 360 game available for purchase": 0,
        "find trade in value for PS4 console": 0,
        "Show me the list of playstation 5 games available for pre-orders.": 0,
        "sell playstation controller for cash credit on GameStop in 43240.": 0,
        "Find the trade-in options for PS4.": 0,
        "Find the store location and hours of the closest Gamestop to zip code 90028 and set as home store": 0,
        "Show me reviews for Elden Ring, best to worst.": 0,
        "Find me the cheapest external HD for an Xbox One.": 0,
        "Find the closest in-store Gamestop location within 50 miles of 21122.": 0,
        "Find Playstation 5 digital edition": 0
    },
    "yelp.com": {
        "Find parking in California city for Limos which also offers military discounts and free wi-fi.": 0,
        "Find a coffee shop with wi-fi.": 0,
        "Search for McDonalds located in Greenvill, SC.": 0,
        "Browse barbershops that have private lot parking.": 0,
        "Look for a best rated  Thai restaurant in Westminster, California, that provides takeout, and whose staff is fully vaccinated and accepts Apple pay.": 0,
        "Browse the highest rated spas that are $$ dollar signs and under.": 0,
        "Find the fast responding highest-rated electrician, who is currently open for replacement of some light fixtures in Westminster, and request a quote.": 0,
        "Find a dry cleaning shop with the highest rating and virtual consultation option for Ironing and stain treatment for a pair of suits and a few delicates in New York City.": 0,
        "Find places that serve burgers in 44012 zip code and sort the results by highest rated": 0,
        "Find the highest-rated locksmith in San Francisco for a key extraction from a vehicle.": 0,
        "Search for Mexican restaurants in Concord, CA and start an order at La Pinata Mexican Restaurant.": 0,
        "Find the highest rated fast responding phone repair shop for data recovery in Houston.": 0,
        "Find an electrician that serves the 94115 zip code and is considered Fast Responding": 0,
        "Find the highest-rated mover in Honolulu to shift a vehicle and large appliances out of state and who has virtual discussion options available.": 0,
        "Browse cafes that have outdoor seating and is dog friendly.": 0,
        "Search for locksmiths near Texas City, Texas that provide virtual consultations and  are open now.": 0,
        "Find Hot Dogs in Oakland, CA that Offers Delivery.": 0,
        "Find the most reviewed cocktail bar with outdoor seating for reservation in San Francisco.": 0,
        "Find the highest-reviewed landscaper in West Hollywood for the design of lawn, who gives fast responses, and make sure he has a license verified by Yelp.": 0,
        "Browse Thai restaurants that offer delivery and have vegan options available.": 0,
        "Get the most reviewed shopping store that accepts apple pay in Central New York.": 0,
        "Search Cantonese food near Chicago, IL that are open now and priced $$.": 0,
        "Create a new Collection Car Wash and Find the most reviewed car wash in San Francisco and save it in the new ccllection": 0,
        "Show the highest-rated boxing gym with a personal training facility and Monthly membership options in Dallas, Texas": 0
    },
    "eventbrite.com": {
        "Get 2 tickets for a free pet festival in English in Portland on april 15 to april 16": 0,
        "Find fitness events for this weekend.": 0,
        "Find popular free online fashion class events occurring this weekend in English, find details of the top result event,  save the event  and follow the organizer of this event.": 0,
        "Find music events in Los Angeles today": 0,
        "Search for all free virtual  business start-up events happening tomorrow in Las Vegas and follow the organizer with most followers.": 0,
        "What are the popular online Health events for tomorr\now?": 0,
        "Search for an engineering open job in Madrid, Spain, if found apply with my details after picking office location, company success and career oppurtunity as applying reason. My name is James Smith and email is buckeye.foobar@gmail.com": 0,
        "Find information on how to get a ticket refund.": 0,
        "Contact Yeah You Right Events who are the organisers of the Food Fight 2023 event being held in New Orleans on May 25th to ask a question about the event": 0,
        "Find a music party in Ohio and follow its organizer": 0,
        "Find exercise events taking place in San Francisco between July 10-31.": 0,
        "Find music event organizers and follow the second one.": 0,
        "Join the waitlist for a ticket for the Hackney Clothes Swap - Earth Day event being held on April 22nd. Name: Joe Bloggs. Email: joe@bloggs.com": 0,
        "Find rock  music events in Canada, happening this weekend and save top three popular events for my record.": 0,
        "Browse the page with event planning tips.": 0,
        "Search for a paid fishing class event on chicago": 0,
        "Find out what popular events are being held this weekend in the category performing and visual arts near Chester, UK": 0,
        "What are the food festivals happening in Colorado This weekend?": 0,
        "Find if any free fashion conventions are happening in San Fransisco and if found save the top three results.": 0,
        "Show me health-related online classes.": 0
    },
    "expedia.com": {
        "Find things to do in Singapore on April 2 that are family friendly and offer free cancellation": 0,
        "Find flights from Los Angeles to Miami for two people departing on July 1st and returning on July 7th.": 0,
        "Find cheapest luxury car rental in New York for two with pickup from JFK airport at 9am, April 3 and drop off at JFK on 6pm, April 6": 0,
        "Search for car rentals in San Francisco for a weekend trip and filter the results by the rental company Avis and car type Economy.": 0,
        "Find a hotel room for one traveler on April 3-6 that is closest to National University of Singapore and costs less than $500": 0,
        "Find first class flight for May 27 from JFK, New York to Heathrow, London for 2 adults, one 4 year old child and one infant under 1 year old who will sit on a lap.": 0,
        "Find the cheapest non-stop or 1 stop flight from JFK, New York to Changi, Singapore for 1 traveler on April 11 which includes seat selection and free cancellation": 0,
        "Find a vacation home in Orlando with a private pool, at least three bedrooms, and availability for the first week of December.": 0
    },
    "us.megabus.com": {
        "Track a bus leaving from Abbotsford.": 0,
        "Browse round-trip bus tickets from Houston to Dallas leaving on May 7th and returning a week later.": 0,
        "Book a one way bus ticket between Albany, NY and Bloomington, NY April 10th and add the second one to cart.": 0,
        "Track the bus with service number 10000001": 0,
        "Book a round-trip from Albany to New York leaving Mar 18 and returning Mar 19  for 3 people": 0,
        "Track my bus with service number SE4.": 0,
        "Track a bus using service number 5456165184.": 0,
        "Find cheapest bus for 2 persons from New York to Washington, DC.": 0,
        "Find out the cancellation policy": 0,
        "Find the next available bus from Chicago to Ann Arbor.": 0,
        "Show me the location of the Altavista bus stop.": 0,
        "Find bus stop information at Abbotsford, WI.": 0,
        "Find a ticket from Abbotsford to Sheboygan on March 26, 2023.": 0,
        "Find bus stops in Alanson, MI": 0,
        "Add to my basket tickets for 3 people from New York to Alfred.": 0,
        "Find information about what I should do when I lose an item on a bus.": 0
    },
    "cabelas.com": {
        "Add a dome tent to my shopping cart.": 0,
        "search for Tree stands with at least 3 stars, and sort the results by price from low to high.": 0,
        "Search and view the details of  32-inch medium-light fishing rod for ice fishing available in stock under 100 dollars with an average rating of 4 and above.": 0,
        "Browse crossbows on sale with limited stock.": 0,
        "Find a black sleeping pad that is under $40.": 0,
        "Find the discount black insulated hunting boots for Men with average ratings over 3.5 stars": 0,
        "Find the gift registry of Carla Cahill, when asked for password use Michael Cahill as name and cahillm@gmail.com as email.": 0,
        "Browse the selection of fishing reels that are power assisted and are in stock.": 0,
        "Find the cheapest Keen branded new pair of women's hiking shoes in the color brown, number 9, available in Columbus, Ohio store, average rating must be above 4.": 0,
        "Enter the bargain cave to buy a 9 mm pistol from the clearance sale and that has an average rating of 4 and 5.": 0,
        "Find 5 star rated saltwater rods.": 0,
        "Look for the lowest priced new aluminum fish boat within 100 miles of Iowa state zip 52554 and call for price.": 0,
        "show the Life Vests priced between $100 and $200.": 0
    },
    "kbb.com": {
        "Search for the cheapest third-party certified front-wheel driving automatic white car for sale near Tampa, Florida with online paperwork and no accidents, confirm availability with my details.": 0,
        "Browse used BWM cars made in 2010 and compare the four cheapest listings": 0,
        "Find the cheapest new electric car with highest ev mile range per charge, see the details of the top result.": 0,
        "Find value of 2016 Toyota Camry XLE Sedan 4D in black color with number plate AZXA46.": 0,
        "Find cheapest 2018 Honda Civic for sale within 100 miles of 07055": 0,
        "Find the fuel economy for a 2005 Toyota Corolla": 0,
        "Browse listings for a used 2006 Honda Civic.": 0,
        "Find the safety rating for 2012 Honda Civic": 0,
        "Show cars with AWD with maximum budget of $50,000.": 0,
        "Get a price quote for new Kia Carnival for 11101.": 0,
        "Get a service estimate on AC recharge of my 2022 Toyota Corrola, L Sedan 4D. My name is James Smith, email is buckeye.foobar@gmail.com, and phone number is 6157075521.": 0,
        "Check reviews for best electric SUV and find the 1 star rated review and mark it helpful.": 0,
        "Find a Ford Mustang with lowest price and save it.": 0,
        "Browse used Audi cars made before 2015 and sort by lowest price": 0,
        "Browse used Mercedes cars made between 2004 to 2012 and sort by highest price": 0,
        "Find a manufacturer-certified Chevrolet truck for sale within 10 miles of zip 42701, if found schedule a test drive for James Smith on April 17 at 4 pm.": 0
    },
    "menards.com": {
        "Find a multi-purpose painting tool available for pick up at zip 44240, if the brand Red Devil is available, add the cheapest one to the wishlist and view my complete wish list.": 0,
        "Look for the cheapest led smart home indoor strip lighting, add it to the cart, and schedule the delivery.": 0,
        "Find tortillas bread in grocery stock near  zip 59901 and add 5 pieces of 12 pcs pack in the cart and view the cart.": 0,
        "Track an order using the order number of 456481897 and phone number of 8984486417.": 0,
        "Track the status of a rebate for Monty Lue, house number 4847, zip code 10019": 0,
        "Find Maytag electric dryers that are at least 7.3 cubic foot costing less than $1000 that are available in store at Montgomery, Illinois with zip code 60538.": 0,
        "Send a 50-dollar home sweet home gift to my friend John with the message Congrats on your new home, and add this card to your cart and checkout.": 0,
        "Find a 19-inch stainless steel kitchen sink with two equal bowls that could be shipped to my home and compare the top two cheapest.": 0,
        "Add the pre made College Supply List to my list.": 0,
        "Add a front load washing machine under $800 to the cart.": 0,
        "Add a Swivel vacuum under $150 to my cart.": 0,
        "Find the weekly ad for the store closest to zip code 82718": 0,
        "Create a new list called Bathroom Remodeling": 0
    },
    "store.steampowered.com": {
        "Open the list of games I've played recently.": 0,
        "Show most played games based on daily players.": 0,
        "Open the list of reviews I wrote about my games.": 0,
        "Purchase the classic bundle for the simulation game Cities Skylines.": 0,
        "Browse a list of adventure games under 30 dollars.": 0,
        "Open my trade offers.": 0,
        "Show me the list of most popular  upcoming game releases.": 0,
        "Open my item inventory.": 0,
        "Add the ghost frame to your avatar using steam points.": 0,
        "Find Dota 2 game and add all DLC to cart.": 0,
        "Browse the list of discussion forums for games I own.": 0,
        "Add to my wishlist the top rated JRPG game.": 0,
        "Open community discussions for Dota 2 game and open latest topic.": 0,
        "Show me the most played games sorted by daily player count.": 0,
        "Show reviews for Fallout 4 and mark the first one as helpful.": 0,
        "Show Massively Multiplayer games which can be played on VR.": 0,
        "Find the highest rated adventure game available for early access.": 0,
        "Find newest farming & crafting simulation games that are free.": 0
    },
    "amtrak.com": {
        "Show me the amtrak national route map": 0,
        "Find trains from New York to Washington DC leaving on april 18 for 2 adults with disability": 0,
        "Find trip for 123456 last name Smith.": 0,
        "Show me current deals for California.": 0,
        "Find the schedule between New York and Washington DC sorted by shortest trip.": 0,
        "Find the details of Grand National Parks tour.": 0,
        "Find a train with the shortest trip from New York, NY to Washington DC on June 1 in first class and add the ticket to the cart,  preferably in the morning .": 0,
        "What are the deals in California": 0,
        "Find a train scheduled between Chicago to Los Angeles for the next day, and if a southwest chief train is available, then print the route details.": 0,
        "Find the empire builder route in West US part of heartland and check the Minnesota stop.": 0,
        "View all conductor trainee job openings in Amtrak New York and apply to the latest job.": 0,
        "Show me routes from NYP to WAS on May 15th.": 0,
        "Get quote for Amtrak vacation for two adults across country while leaving from Chicago on the 22nd of April. It should include Deluxe bedroom. The passenger is named John Mark with email address of johnmark@gmail.com and phone number of 234567890.": 0,
        "Get a ten-ride ticket from Washington to New york starting from April 5": 0,
        "Find the terms and conditions of Amtrak RideReserve for Multi-Ride Passes": 0,
        "Tell me more about the Adirondack route.": 0,
        "check the national cafe menu": 0,
        "Find Auto train going from Moynihan to Chicago IL leaving on April 22nd to 29th for 2 adult.": 0,
        "Show me schedules for the Blue water route on Wednesdays": 0,
        "Book the lowest priced auto train ticket for Mayank Raheja who is deep an need seat in lower level, is carrying a bike but has no service animal,needs assistance from Lorton to Sanford on June 10 between 12 to 6 pm.": 0,
        "Tell me information about what identification I need to bring on my trip.": 0
    },
    "rei.com": {
        "Trade in a Nemo Front Porch 2P Tent via mail with my membership info Joe Bloggs, phone number 123456789": 0,
        "Browse the women's hiking boots section and filter the results to show only those that are waterproof and have a rating of at least 4 stars and size 6.": 0,
        "Search for hiking boots and filter the results to show only those with a waterproof rating of at least 3 stars.": 0,
        "Order one TAHE inflatable stand up paddle board using my default account/shipping info.": 0,
        "Find camping tents that can fit 6 people and sort the results by price from low to high.": 0,
        "Browse camping stoves that have an auto ignition feature.": 0,
        "Order the cheapest climbing shoes in today's deals.": 0,
        "Show bike service charges for store at Lafayette St, 10013.": 0,
        "Show camping hammocks with lowest price first.": 0,
        "Buy the cheapest used women's running shoes available in a size 5": 0,
        "Buy a GoBites Uno Spork in the color magenta and have it delivered to a store in Seattle, WA. Checkout with default address, and use credit number 123456789, CVV 123, expire 01, 2024": 0,
        "Find climbing gear and sort the results by price high to low.": 0,
        "Browse climbing courses within 50 miles of 90028.": 0,
        "Find Travel Pack for hiking.": 0,
        "Find rental charges for bikes in 37863.": 0,
        "Find a hydropack and make  the results to show only items that have a capacity of 21 to 35L.": 0,
        "Search for kayaks and filter the results to show only those that are suitable for whitewater rapids.": 0,
        "Add a pair of large Yaktrax traction cleats to the cart.": 0,
        "Sign up for a REI Co-Op membership.": 0,
        "Select a E-Gift card with Congrats design and add to cart with Best Wishes as a message. Send it to James Smith with email abc@abc.com": 0,
        "Book a place on the next available mountain biking class running within 100 miles of New York City for Joe Bloggs. The email address is joe@joebloggs.com and the phone number is 1111111111. Emergency contact's name is June and phone number is 2222222222. The gear sizing is 6 ft height\n.": 0
    },
    "amctheatres.com": {
        "Find theaters for Creed III within 20 miles of zip code 90028.": 0,
        "Show me the full menu for AMC dine-in locations.": 0,
        "Show me the movies playing today at the theater closest to zip code 10001": 0,
        "Order popcorn at AMC Grove City 14": 0,
        "What is trending now on AMC on-demand?": 0,
        "Find a theatre near 10001": 0,
        "Show me the coming soon AMC Artisan Films": 0,
        "Find showtimes for John Wick 4 at a theater in Wichita, Kansas 67226": 0,
        "Check the balance for a gift card with the number 1000000000000000 and pin 1222": 0,
        "Browse the on demand sales section and rent a film in HD format.": 0,
        "View the full menu for AMC Dine-In": 0,
        "Check the movie \"65\" that is digital at the AMC Grove City 14 showing at 7:30 pm on Tuesday, March 28, 2023 and buy four tickets for seats J10 through J7": 0,
        "Show me the newest on-demand releases.": 0,
        "Check my AMC gift card balance with gift card number 87654321 and pin number 9753.": 0
    },
    "carnival.com": {
        "Show me FAQs related to eating and drinks": 0,
        "Go to the page with information about luggage and what to bring.": 0,
        "Show me all my offers for 2-5 day cruises": 0,
        "Add to my favorites a cruise for 4 people going to Caribbean.": 0,
        "Show me all the cruises that go from Miami Florida to The Bahamas": 0,
        "Shop 2-5  day cruises to the Caribbean from Miami during August 2023.": 0,
        "Find carnival cruise options that include Alaska.": 0,
        "Find offers for VIFP Club loyalty number 9016467685 and show the ones that are for members only.": 0,
        "Begin booking a 14 day cruise from Los Angeles to Hawaii": 0,
        "Order an adult’s bottomless bubbles package for Joe Bloggs who is booked onto cruise 101010": 0,
        "Find cruises to Hawaii departing from Los Angeles in January 2024 with a duration of 12 days.": 0,
        "Find travel agents in Grand Junction, Colorado": 0,
        "Find Alaska Cruises from Seattle in September 2023 with a duration of 8 days for 4 people on a ship Carnival Luminosa.": 0,
        "Add to favorites a cruise from San Francisco to the Panama Canal departing Oct 2024": 0,
        "Get me info about planning a wedding cruise": 0,
        "Browse the trending daily deals.": 0,
        "Show me the breakfast options on the Carnival Breeze ship.": 0,
        "Search for a 10 day cruise to Alaska from San Francisco in June 2023.": 0,
        "Book an interior room for over 10 days on a cruise for two people from Brisbane to Papua New Guinea leaving November 2024. Check out with default options and pay in full.": 0
    },
    "apple.com": {
        "Find the Display details of new lanched iPad pro 11-inch": 0,
        "Show information on how to find lost AirPods.": 0,
        "Check the order status using an order number of24124124091. The email address is boobear@gmail.com": 0,
        "Find Apple Stores close to zip code 90028": 0,
        "Find the price of HomePod mini": 0,
        "Add a blue iPad to your cart and select the option for free engraving with \"hello world\" with no other accessaries.": 0,
        "Locate the nearest apple store to zip code 60540 and check its opening time tomorrow.": 0,
        "Find technical specs for the latest Macbook Air.": 0,
        "Add Pro Display XDR with nano texture to bag with all the accessories and check total.": 0,
        "Compare Apple watches and  learn more about the ultra version.": 0,
        "Check the status of your iPhone repair.": 0
    },
    "target.com": {
        "Find a store in Magnolia Texas.": 0,
        "Find target branded sprinkles for easter baking": 0,
        "Browse winter coats featured in the weekly ad and is at least 15% off.": 0,
        "Find organic dog food and add it to the cart.": 0,
        "Shop for the same-day delivery of thin crust frozen pepperoni pizza and add 2 packets to the cart.": 0,
        "Find Target Stores located near Cincinnati, Ohio and filter by those that have a Starbucks.": 0,
        "Find hard side Carry-on Luggage used for business in black color.": 0,
        "Explore Games & Puzzles in the Toys category that are suitable for ages 14+": 0,
        "Find a registry in the name of Sheldon Cooper in Arizona and sort by latest to soonest.": 0,
        "Check the availability of a Nintendo Switch gaming console at the nearest Target store.": 0,
        "Find multi-colored fillable eggs for easter eggs made from polypropylene priced between 5 to 10 dollars for pick-up from Barboursville, zip 25504.": 0,
        "Add a set of queen-sized bed sheets with at least a 4-star rating to the cart.": 0,
        "Find the 24 count cheapest septic safe mega-size toiler paper in buy-and-save offers and add to the cart for pick-up.": 0,
        "Browse throw pillows and filter by black and decorative sets.": 0,
        "Search for job in Miami Florida in Human resources.": 0,
        "Get the frozen vegan cheese pizza between 5 to 10 usd.": 0
    },
    "marriott.com": {
        "Look for a room at the Marriott Bonvoy resort in the Caribbean for a 10-day stay starting on May 5th.": 0,
        "Find two rooms in a cheapest  hotel in Niagra Falls for three adults and one three year old  kid from May 17 to May 20, view only available hotels within 100 to 200 dollar range  with taxes and fees, and choose the cheapest hotel that offers free breakfast and a pool.": 0,
        "Find The Ritz-Carlton hotels in Washington DC that can hold a student social event from May 9 to May 12 and will require 7 guest rooms and an event space for 50": 0,
        "Look for an internship role for a university graduated in the  in Germany, and apply to the job posted in last 7 days.": 0,
        "Find highest rated room for one adult in Los Angeles, CA between May 7 to May 14 which offers senior discount, free breakfast, is pet friendly and has a pool": 0,
        "Find a wedding venue in Venice Beach California  in June for 100 guests.": 0,
        "Get the Promo Code for Spring Break Savings and packages.": 0,
        "Shop for a Four Points by Sheraton gift card of value 150 dollars with Marriott deluxe box and add it to the cart in the name of Clara from James with a happy Christmas message and checkout.": 0,
        "Use the \"Meetings & Events\" section of the website to browse locations for a business meeting for one room and 20 guests in Boston from May 30th to June 1st.": 0,
        "Find details on converting points to miles.": 0,
        "Search for queen-size pillow protectors from the Marriot shop, and if found, add two pieces to the cart and checkout.": 0,
        "Find five star rated cultural tours in New York on May 7 with a max price of $75": 0,
        "Book a room for a business meeting from Apr 30 to May 1 with 7 people within 5 miles of New Delhi. The hotel must have a business center and offer high-speed internet, select the nearest hotel.": 0,
        "Check balance of gift card no. 1234567 with pin 0001": 0,
        "Find the cheapest single room in Dubai Marriott or Sheraton for two adults and a child under one between May 7 and May 10": 0,
        "Start the process of buying a gift card with a beach theme.": 0,
        "Book a room from Apr 30 to Jun 5 for two adults in Tallahassee.": 0,
        "Browse Marriott Bonvoy credit cards.": 0
    },
    "amazon.com": {
        "Look for an English language book on roman empire history in the Kindle store released in the last 90 days, it should be displayed according to its latest publication date, and add the top result to the shopping list.": 0,
        "Find a pair of mens running shoes in black, size 7 extra wide, 4+ stars and under $50 and add them to my cart": 0,
        "Browse dog food for puppies that is rated at least 4 stars and sort the results by price from low to high.": 0,
        "Show mattresses available with Amazon Basics and Follow the store.": 0,
        "Add $100 Google Play Gift Card to cart and recipient email address as abc@abc.com": 0,
        "Show all the external solid state drives available with lowest price first.": 0,
        "Add a smartwatch to the cart that is compatible with an iPhone.": 0,
        "Find the cheapest new surge protector with 6 to 8 outlets under 25 dollars with customer reviews above 4+, add 2 pieces to the cart.": 0,
        "Find a dog bed on Amazon that is machine-washable and has a diameter of at least 30 inches.": 0,
        "Find the cheapest full-sized Amazon basic comforter with 4+ average customer reviews and priced between 50 to 100 dollars, if red color availabe in the cheapest product then add one to the cart.": 0,
        "See today's deals on video games and find the best deal on the lowest-priced mouse.": 0,
        "Find Metformin 1000mg tablet price and details.": 0,
        "Find a book by Sam Harris that has a rating of at least 4 stars and is available in paperback format.": 0,
        "Add a pack of toilet paper and a bottle of laundry detergent to your Amazon cart with the lowest total price.": 0,
        "Search for \"you are Amazing\" congrats gift card which can be printed and folded at home, priced between 50 and 100, and add two 50-dollar cards to the cart.": 0,
        "Add a set of wireless headphones to your cart with a budget of $100 or less, that has an active noise-cancelling feature.": 0
    },
    "ebay.com": {
        "Find the cheapest new  trash can with automated lid that is under $60 and available for Buy It Now.": 0,
        "Find an foldable over-ear headphone under 35 USD in certified refurbished condition with lowest price + shipping.": 0,
        "Browse new laptops from $400 to $500 that offers free shippping.": 0,
        "Find the most recently posted job opening in customer service in Ireland with a remote working option.": 0,
        "Find a newly listed pre-owned man Nike shoe in size 9 with free local pickup under 75 dollars.": 0,
        "Find a newly listed used antique Oak chair in the French style made before year 1800.": 0,
        "Search for rare books and sort the results by auction end time.": 0,
        "Find musical instruments and filter the results to show only those that are available for free local pickup.": 0,
        "Find vintage clothing and sort the results by price from high to low.": 0,
        "Browse xbox series x consoles that are used and between $200 and $400.": 0,
        "Search for video game consoles and filter the results to show only those that have Wi-Fi Capability.": 0,
        "Search for Dining Room Sets under furniture and filter the results to show only items availble under the Buy It Now format.": 0,
        "Find a Blue iPhone 12 Pro 128gb and add to cart.": 0,
        "Browse mens Timberland boots in size 9 and under $100 and filter by lowest price.": 0,
        "Browse washing machines available for free local  pickup within 25 miles of zip code 90026.": 0,
        "Get a Hasbro Hulk action figure manufactured in 1990 with the lowest price + shipping.": 0,
        "Find the cheapest used and working  Nintendo Switch for under $400 that can be bought right now.": 0
    },
    "kohls.com": {
        "Add 10 of the cheapest green shirt to my cart": 0,
        "Browse black strollers within $100 to $250.": 0,
        "Find mens hiking shoes under $100 in size 10 that has biggest discount.": 0,
        "Show the most popular Women's Athletic Shoes.": 0,
        "Locate a store in spring, Texas.": 0,
        "Add a set of sonoma bath towels to the cart and apply a coupon code for free shipping.": 0,
        "Show me the new arrivals on Easter home decor": 0,
        "Browse best selling black hoodies in mens size Big and Tall that is between $25 and $50.": 0,
        "Find a cheapest washable blue rug under 2'x3' size.": 0,
        "I want to see the best seller gender neutral skirts": 0,
        "Find the highest rated dog collar under 10 dollar.": 0,
        "Browse for wall art with a price range of $25 to $50.": 0,
        "Add the cheapest Women's Sweaters to my shopping cart.": 0,
        "Add a pair of diamond stud earrings to the cart.": 0,
        "Get the lowest priced plus size one piece active swimsuit in color black.": 0,
        "Find the cheapest women's plus size brown color loungewear in 3xl size.": 0,
        "Browse spider-man toys for kids and sort by lowest price.": 0,
        "Get the lowest priced women's plus size one piece swimsuit in color black with customer rating of atleat 5.": 0,
        "Browse the clearance section and filter for women's dresses in size small.": 0,
        "Find direction to a store in Ohio, Cincinnati which does't have Sephora in it.": 0,
        "Browse coffee makers that are rated 5 stars.": 0,
        "Browse men's winter coats in size large that is on clearance.": 0,
        "Show me products from Calvin Klein brand menswear list.": 0
    },
    "flightaware.com": {
        "Get route information for flights from Ohio and New York airports that have already arrived.": 0,
        "Compare FlightAware subscriptions and signup for Enterprise plan.": 0,
        "Search for flights available from Calgary (CYYC) to New York (ZNY).": 0,
        "Find map for the KCCR airport": 0,
        "Find flights from Washington airports to New York airports and only show those with scheduled status.": 0,
        "Find a flights between SFO and EWR using the Boeing 787-9 aircraft": 0,
        "Find careers at the company on the Product Management team": 0,
        "Open the most popular photos of the Adam A-500 model aircraft.": 0,
        "Look up Popular Photos in the Community featuring Aegean Airlines": 0,
        "Find the status of flight #039028": 0,
        "Show the list of countries with the highest number of seen aircrafts.": 0,
        "Find Airport information of Camarillo Airport, CA and check weather.": 0,
        "Find discussions of community and open one with most replies.": 0,
        "Find solutions for Airport and fill the contact form with message to \"Send Brochure\". Contact information John Smith. Email: abc@abc.com. Phone #: 88889999": 0,
        "Compare available plans for the AeroAPI.": 0,
        "Find flights going from Indira Gandhi to Los Cabos.": 0
    },
    "exploretock.com": {
        "Find tickets for Pizza making class in New York next month.": 0,
        "book a reservation for three guest on April 5th, 5pm in Alinea restaurant, Chicago, IL": 0,
        "check restaurant with delivery service available 6pm on Mar 25th in Detroit, MI.": 0,
        "Find pizza serving restaurants for pick up in Chicago, sufficient for 10 people on March 30, 8:15 PM from a joint which also offers dining package.": 0,
        "Check if 5pm is available to book a indoor reservation on 31st of March in Matthews Winery for 5 people": 0,
        "Find food delivery services of American cuision in New York for 4 people on March 20, 8 pm.": 0,
        "Check for pickup restaurant available in Boston, NY on March 18, 5pm with just one guest": 0,
        "Book a winery tour in Napa Valley in a winery which serves Mediterranean cuisine with wine testing for 4 guests on April 15, 10 am in a outdoor setup.": 0,
        "check all restaurant available in Buchanan, MI to book a dine in reservation with Spanish cuisine for 2 guest at 8pm on 18th of March.": 0,
        "Book a dine in reserveration in New Delhi for 5 Guests on 22nd March, 7:00 pm, terrace seating arrangement preferred.": 0
    },
    "tvguide.com": {
        "Find all watch options of Avatar: The Way of Water and where it's available.": 0,
        "Add 3 most rated to watch tv shows or movies on Amazon Prime to watchlist.": 0,
        "Find cast and crew of Titanic and add to watchlist": 0,
        "Find the trailer for a new winter  show from HBO.": 0,
        "Show episodes of Alien Worlds and check where to watch Episode 4 of Season 1.": 0,
        "Show latest documentaries on Netflix and add the one with 70+ metascore.": 0,
        "Browse comedy TV shows streaming on HBO Max that was released in 2010.": 0,
        "Find the channel number for the local CBS in Spokane Washington in 99201.": 0,
        "Find the birth place of Ali Wong.": 0,
        "Browse documentaries streaming on Netflix.": 0,
        "Find and view the biography for the Host of the Price  is Right.": 0,
        "Add The Wire to the watchlist.": 0,
        "Find more films from the director of Smile.": 0
    },
    "nps.gov": {
        "Find detailed uses of Anuall Pass for 2023 on the USGS Online": 0,
        "Locate a park that has a campground and is located in the state of Colorado.": 0,
        "Find a living History event to attend in in April .": 0,
        "Locate Dry Tortugas in the state of Florida and find out the Current Conditions.": 0,
        "Search for a park in the state of California called Castle Mountains National Monument and find out it's Basic Information.": 0,
        "Find a park in the National Park System that is related to the topics of Industry and also Laborer and Worker.": 0,
        "Find a list of available opportunities for a volunteer event for year 2023": 0,
        "Find the alerts and conditions for the Alagnak Wild River.": 0,
        "Browse the photo gallery of Acadia National Park.": 0,
        "Show me a list of children's program events in Illinois.": 0,
        "Find a park in Alaska that is also a National Heritage Area.": 0,
        "Open Canyon de Chelly schedule calendar.": 0,
        "Find a park in the National Park System that has a Junior Ranger Program for kids.": 0
    },
    "carmax.com": {
        "Search for used BMW X5 Crossovers and compare the mileage of the first two cars.": 0,
        "Find a store in Los Angeles, California, and set Riverside as my store and add a card from that store to my favorites": 0,
        "Show me the service options for cars under warranty.": 0,
        "Search for an automatic grey sports car with the lowest price, gas fuel and free shipping manufactured between 2018 to 2022, compare the top two results and compare photos.": 0,
        "Change your store to the one nearest to 07055": 0,
        "Find the documents required to sell a car in New Jersey for which payments are being paid and it has single person on the title who can come to the store": 0,
        "search the most recent full time Accounting & Finance Job available in Richmond, Virginia.": 0,
        "Find series 1 and series 2 BMW vehicles in the store nearest to 07055": 0,
        "Find estimated monthly payments for a $10,000 vehicle with $500 down payment, 72 month term length and challenged credit score in the state of New Jersey": 0,
        "find a CarMax in Michigan, 49107 and book an appointment for a car repair on April 7th..": 0,
        "Find a Chevrolet with lowest mileage in zip 08817 with shipping charges of 99 dollars or less, with a price between 20k to 30k.": 0,
        "Find the cheapest 2017 Honda Civic within 100 miles of 07470 which has a sun roof and black exterior color while excluding out of market vehicles": 0,
        "Calculate vehicle price with a challenge credit score, monthly payment of $250 with a $3000 down payment and 24% APR for 48 months in Tennessee.": 0,
        "Find a store in Modesto California and set is as my store.": 0,
        "Calculate the monthly payment of a 15k car with a down payment of 5k in Michigan for a fair-rated person for a term length of 48 months, then shop with this budget for the cheapest car and add it to the favorites.": 0,
        "Search for used Jaguar XFs with no black exterior color and save the search as Jaguar  to get a notification daily.": 0,
        "search gas pickup truck in Fremont with 2010 and 2017 with less than 80000 mile": 0,
        "see Nissan and Honda cars for sale near Kentwood, MI 49512": 0,
        "Find Chevrolet Silverado with black exterior color and maximum value of $30,000.": 0,
        "Search for a full-time job in sales in Springfield and apply for the most recent job.": 0,
        "Find a 2022 Tesla Model 3.": 0,
        "Find Toyota Corolla from the year 2018 to 2023 in red color.": 0
    },
    "jetblue.com": {
        "Show route map and flight cost from Los Angeles to Miami on 12 April.": 0,
        "Check the status of flights from Los Angeles area to Boston area tomorrow": 0,
        "Find the cheapest flight from any New York airport to Aruba for 1 person using TrueBlue points which leaves on May 1 and returns on May 5": 0,
        "Find ground operations jobs with JetBlue.": 0,
        "Book two rooms in the cheapest 3-star hotel which provides free breakfast, and free airport transportation for three adults, and one child from April 22 to 25 in texas city, the hotel should provide amenities for kids.": 0,
        "Find JetBlue press releases for the year 2020": 0,
        "Find the flight from New York to Miami from Mar 27 to Mar 31  that has the lowest core price in points.": 0,
        "Find JetBlue career openings in New York": 0,
        "Find check-in flight for John Smith having ticket no. 123456780": 0,
        "Book a flight + cruise for two flying from Atlanta in October for vacation starting on October 8 for 6 nights with Miami as the departure port, choose the cheapest flight, hotel, and room in the cruise for booking.": 0,
        "Look for a business class flight to Paris from Salt Lake City on June 2, with a return on June 7, and checkout": 0,
        "Book the cheapest economy flight between Miami and Nairobi for two adults on May 4 with a return option on May 8.": 0,
        "Find cheapest flight from New York to Toronto, Canada on 29 April.": 0
    },
    "seatgeek.com": {
        "check ticket listing on floor B row 17 seat listing to Beyoncé music concert on Mon Aug 14 at 7:00pm.": 0,
        "check 2 of WrestleMania single day Parking Passes on April 1st in California near LA.": 0,
        "Find parking prices for upcoming Los Angeles Lakers games.": 0,
        "Find tickets for the next pop concert.": 0,
        "Find out if Coldplay is playing any events in Columbus, OH on May 17.": 0,
        "Browse the page to find classic rock concert tickets.": 0,
        "Search for comedy shows taking place in Chicago, IL and expand the results once.": 0,
        "check the lowest price ticket including fees to the next M3 Rock Festival - 2 Day Pass": 0,
        "search the best VIP seat to the Red Hot Chili Peppers 2023 Tour": 0,
        "Search for all Alternative Concerts taking place in New York City.": 0,
        "Show me the page with information about the NBA Finals schedule.": 0,
        "Search for concerts taking place in Los Angeles, CA in the next month.": 0,
        "Find all events taking place in New York City during the month of September.": 0,
        "Find help page about buying tickets.": 0,
        "check two ticket with best seat that has promo code first show happening in Hamilton New York on April.": 0
    },
    "mbta.com": {
        "View the upcoming schedule from Otis St@Summer St to City Point of the transit near South Station for today.": 0,
        "Show me the planned service alerts for the subway red line": 0,
        "Show me the upcoming departures for the oak grove station going southbound direction": 0,
        "Plan a trip from Braintree to Boston Airport on April 14, 12 pm, and see the fair calculator.": 0,
        "Show me the schedule and maps for the orange line": 0,
        "Find the schedule of the East Boston ferry, check connections, and fares  and download the pdf schedule.": 0,
        "Show information about careers with MBTA and signup for customer service job alerts. Name: James Smith. Email: abc@abc.com": 0,
        "Find information about reduced bus fares.": 0,
        "Find rail for Oyster Bay, Provincetown.": 0,
        "Plan a trip from Boston Logan Airport to North Station.": 0,
        "Open red line subway schedule.": 0,
        "Show current alerts for red line subway.": 0,
        "Find a parking lot in Gloucester and book a ride from there to North Plymouth on April 28, 2:30 pm, view the map to understand the route better.": 0,
        "Calculate the fare options to go from the south station to the north station": 0,
        "Plan a bus trip going from the Boston Logan Airport to South Station": 0,
        "View the latest job openings in safety with a salary above 100k per annum, check the details, and apply.": 0,
        "Schedule an appointment to apply for transportation access pass in  the Charlie Card store on May 8, 10:15 am, fill in my details (James Smith, james.smith@gmail.com), and book.": 0,
        "Show schedule for East Boston Ferry outbound Lewis Wharf and Long Wharf (North) stop.": 0
    },
    "instacart.com": {
        "Find an available wine at Kroger.": 0,
        "Open gift list for beauty products.": 0,
        "Add eleven produce items from Aldi, including 1 pack of blueberry, 6 bananas, 1 grape tomato, 1 roma tomato, 1 cilantro, to my cart and have it delivered tomorrow between 10am and 1pm to the default address.": 0,
        "Find the cheapest  bananas at Kroger": 0,
        "Search for Gingerbread cakes recipe and add ingredients to cart.": 0,
        "Create a new list and add four items from the personal care category at Walgreens.": 0,
        "Find the push notification settings": 0,
        "check prices of organic strawberries with three different stores and add the one with lowest price to cart for 94105.": 0,
        "Find nearest Sprouts Farmers Market and add two fruits and one sauce from the deals.": 0,
        "Add a new address to the account. The address is 2983 Marietta Street,  APT 2. Business name is Buck.": 0,
        "Add 2 different flavor dog treats and one dog food with lowest price to cart from Safeway.": 0,
        "Find grocery deals at Costco": 0
    },
    "newegg.com": {
        "Compare two wireless printers that are rated above 4 stars.": 0,
        "Find the cheapest unused wireless Logitech Keyboard under $70.": 0,
        "Find an Xbox Wireless controller rated above 4 stars.": 0,
        "Remove the SSD on my cart": 0,
        "Build a PC with Intel i9 Raptor Lake 24 cores, Asus ROG strix Z790 motherboard, Asus TUF Rtx 4090 and remaining all compatible products with SSD.": 0,
        "Find the cheapest Samsung-made and larger than 11-inch screen Android tablet, in the price range of 200 to 300 dollars and add it to the cart.": 0,
        "Find a projector which accepts crypto currency as payment.": 0,
        "Find a gaming desktop with an rtx4000 GPU, available in stock.": 0,
        "Find an LED TV below $1000.": 0,
        "Show the Recommended Gaming PCs for someone who plays Fortnite, Overwatch and GTA V at 4k": 0,
        "Find a Lenovo laptop under $800 and create a price alert for $400.": 0,
        "Browse laptops with at least 16gb of ram and under $700.": 0,
        "Find the most expensive Sony controller compatible with PS5 with free shipping and add it to my cart.": 0,
        "Browse bluetooth headphones with active noise-cancellation.": 0,
        "Upgrade the count of the current SSD in my cart to 10": 0,
        "Find the lowest-priced single pack of Xerox genuine magenta toner sold by Newegg with free shipping.": 0,
        "Add Western Digital internal SSD with 1TB storage and 8GB Ram DDR to the cart.": 0,
        "Find the cheapest power supply unit with at least 600W power output.": 0,
        "Find a wireless keyboard and mouse combo under $100.": 0,
        "Find a gaming pc which can run Call of Duty Warzone at 4k.": 0,
        "add a motherboard under $200 and a compatible processor at any price to the shopping cart.": 0,
        "Build an entry-level pc with an windows 11 64 bit intel i7 CPU with a256gb ssd drive +  4gb ram and adding cheapest component and accessories available.": 0,
        "Find 32\" Curved monitor and add the third one to the wish list.": 0,
        "Look for an intern career within Newegg in City of Industry, California, USA, and bookmark it.": 0,
        "Make a build list with AI for a gaming pc with ryzen 9,rtx 6950xt and  price $2000-$2500.": 0,
        "Find a new drone priced between 25 to 50 dollar and ships from USA with average customer rating of 4 and upwards and save the search at the end.": 0,
        "Find bluetooth vertical mouse with most reviews and add two to my shopping cart..": 0,
        "Add the cheapest SSD to my cart": 0
    },
    "boardgamegeek.com": {
        "List of publishers for board games": 0,
        "View the complexity rating for Frosthaven.": 0,
        "What are Gloomhaven's ratings?": 0,
        "Show me the list of BGG shirts for sale": 0,
        "Show me the recent trades": 0,
        "Add games with the title Atlantis to my collection.": 0,
        "Buy the number 4 ranked board game on the geekmarket.": 0,
        "Send a message to Joe Bloggs who has the username 'boredcelt'.": 0,
        "What are the BGG rules for Game Submissions?": 0,
        "Buy the cheapest copy of King of Tokyo on GeekMarket that ships to Canada.": 0,
        "Add the #1 and #2 ranked boardgame to a collection.": 0
    },
    "yellowpages.com": {
        "Find a person by phone number 123456789.": 0,
        "Ask a question regarding Health Insurance Top Up plans beneficial or not?": 0,
        "Show me japanese restaurants in Fresno with online delivery.": 0,
        "Search for person named John Smith in New York.": 0,
        "Find deals in New York.": 0,
        "Find an attorney for divorce in Union City, NJ.": 0,
        "Show me the map of Cleveland's animal shelters.": 0,
        "Filter car accident lawyers in Stanford, CA, sort them by distane and find the phone number of the nearest one.": 0,
        "Browse restaurants, open 24 hours, and sorted by rating.": 0,
        "Find beauty salons that are rated A and accept coupons in Seattle, WA.": 0,
        "Find a veterinarian emergency service for dogs in Hawaii with a BBB rating of A+": 0,
        "Find a pedicure salon in New York and add two to favorites.": 0,
        "Open the page to answer a question in the home improvement section.": 0,
        "Search for coupons and deals in New York.": 0,
        "Browse the trending searches in Columbus.": 0,
        "Get the nearest attorney in West Hollywood, Florida, who can handle drug charges, accepts credit cards, and speaks Spanish.": 0,
        "Look for hair salon coupons in San Diego.": 0,
        "Find a dentist for teeth whitening in Chicago.": 0,
        "Find the top-rated bar and grill restaurant in Miami, Florida that has live music and is good for groups.": 0,
        "Browse through the Las Vegas city guide and find message services nearest to Henderson, the service provider should have a BBB rating of A+.": 0,
        "Find a person by address Nice st - 1234, Good, FL.": 0,
        "Find medicaid covered dentists sorted by distance.": 0,
        "Show list of popular businesses in Cleveland.": 0
    },
    "booking.com": {
        "Reserve a taxi from O'hare Airport to 123 Main St, West Chicago, IL on Mar 29, 2023 at 12 noon for 2 adults.": 0,
        "Show ticket price for Aquarium of Paris for 2 adults on May 5th.": 0,
        "Book a low-priced small air-conditioned car on rent in Mexico City Airport for under 100 dollars and book without insurance for next day.": 0,
        "Find a 4 star rated Hotel in New York Timesquare for 2 adults.": 0,
        "Find a 3-star rated hostel with balcony and free cancellation option in Udipi, Karnataka for one person under 50 dollars from June 15 to 20, free wifi is compulsory.": 0,
        "Book a flight for two adults from Shanghai to Seoul on May 10, and return on May 12 also book a hotel with it, with maximum bundled savings and if top hotel not available book the next one.": 0,
        "Find the lowest-priced round trip flight with hotel on May 2 from Kathmandu, Nepal KTM to Shanghai, China PVG and return on May 5. Book a double room and check out with the default flights.": 0,
        "Find the most popular tours and attractions in Kyoto, Japan from May 25 with free cancellation option, check availability for 2 adults and 1 infant, and book.": 0,
        "Book the cheapest 3-star hotel or resort for two within a budget of 50 to 100 dollars for four days starting from April 25, near the beach in goa that offers breakfast, wifi, a swimming pool, and free cancellation.": 0,
        "Book fasted flexible direct flights from New York to Tokyo on June 1, between 6 to 12 pm departure, and from Tokyo to New Delhi on June 5.": 0,
        "Find an entire home with a rating above 5 for two in Manila, Philippines from June 1 to 8  with self-catering, double bed, free wifi, and walk-in shower, check the availability, and reserve.": 0,
        "Get the cheapest hotel room for 1 adult with a free wifi in Seoul from 10th to 12th April for work purposes with no prepayment and a review score of 7+.": 0,
        "Book a one-way, fastest, and most flexible direct flight ticket for two from Banglore to Goa on March 29 evening.": 0
    },
    "new.mta.info": {
        "Find out about planned service changes on the 4 Subway on 5/3/2023.": 0,
        "Find information about how to buy metro card on booth.": 0,
        "find the next available subway train to Grand central station, NY departing from Queensboro plaza station, Long Island, NY.": 0,
        "download pdf for list of accessible station in NYC.": 0,
        "Plan a trip from Greenport to Oyster Bay Branch, starting with train and ending via bus with less than 1/2 mile walk.": 0,
        "find schedule for Long Island Rail Road & Metro-North Railroad from Bay Shore to Breakneck Ridge on Thu, Mar 23, 08:37 AM.": 0,
        "Get details of the fastest trip between 52nd Street,Brooklyn and 74th Street, Brooklyn, leaving now, that is accessible for a disabled person.": 0,
        "Find the subway station nearest to 07055": 0,
        "Plan an accessible trip from empire state building to little Caribbean with least walking": 0,
        "Find all outdoor events this month in NYC": 0,
        "check car toll rate for bridges and tunnels": 0,
        "Get a list of Administrative and Clerical jobs MTA is currently recruiting for in Brooklyn": 0,
        "View Fares from Grand Central to Stoney Brook for Port Jefferson after 10:00pm for adult.": 0,
        "Plan a trip with the least amount of walking from Central Park Zoo to the Broadway Theater.": 0,
        "View the special timetable for Far Rockaway Branch of the Long Island Railroad.": 0,
        "Find the motorcycle toll fee for the Queens midtown tunnel.": 0,
        "Plan a trip from Brooklyn, NY to Staten Island, NY on March 25th mainly using bus and subway terminal. The trip should arive at 9:45 AM.": 0,
        "Check the status of train S92 for any disruptions.": 0,
        "Get the report from the final environmental impact statement for the Jamaica Bus Depot expansion.": 0,
        "Plan a trip to reach JFK airport from central park by 11am on April 12": 0,
        "Find the list of all neighborhood maps for Brooklyn": 0,
        "check all jobs position available by department in Downtown, Manhattan.": 0
    },
    "agoda.com": {
        "Find a hotel with lowest price in Tokyo for 2 adults and 1 child for 10 May and checkout on 12.": 0,
        "Find a cheapest flight from London to New York on 9th May.": 0,
        "Find hotels in Tokyo for two adults and one child, with a budget of $500 per night for 2 nights starting on May 5th.": 0,
        "What are today's Limited Time Offers deals?": 0,
        "Find the cheapest and highest-rated hotel in the Navi Mumbai area of Mumbai, India, on April 12 for just one day.": 0,
        "Search a cheapest homestay with balcony in Bali, Indoneshia from April 1 to 4 for 2 adults and 4 children aged 3, 5, 8, and 12 years, respectively, double beds prefered, including breakfast.": 0,
        "find a cheapest direct flight From mumbai to new delhi, India, on june 1 and return travel on june 8.": 0,
        "Find out details about cancellation fees.": 0,
        "Find rental for an economy car in Houston from Mar 10 to Mar 13.": 0,
        "Find the cheapest motel for 2 adults in Seattle from 11 May to 18 May": 0,
        "Look for activities in Phuket, Thailand.": 0,
        "Show activities in Miami with lowest price and minimum 4 star rated.": 0,
        "Look for the highest reviewed for a 4-adults stay in Hollywood, USA, on April 19 to 23 with an option for free cancellation with a price range between 150 to 200 dollars.": 0,
        "Find a resort near Patong beach in Phuket, Thailand nearest to the airport from May 9 to May 12 for two with a pay-later option.": 0,
        "Find a apartment in New Delhi for 5 days starting April 11.": 0,
        "Book a flight for 2 adults from Belo Horizonte to Buenos Aires on April 24": 0
    },
    "ticketcenter.com": {
        "Book 2 hot seat VIP tickets through email id adelefan@hotmail.com for Adele's concert in Las Vegas on the last weekend of June.": 0,
        "Show me events in Phoenix for the next 3 days.": 0,
        "Find parking passes for New York Yankees game on April 14": 0,
        "Browse hip hop concerts that are happening this weekend.": 0,
        "Find events in Lubbock, Texas during next 7 days": 0,
        "Find tickets for events in Boston.": 0,
        "Get tickets for the Buckeyes football game on April 15th for a group of 5 people.": 0,
        "search for tickets for los angeles kings this weekend": 0,
        "Find reggae concerts this weekend.": 0,
        "Get WWE tickets for April 10 event happening in seattle, and book 4 cheapest lower level tickets.": 0,
        "Find tickets as gifts and book 2 tickets for stand-up comedian Dave Chappelle and the roots shows.": 0,
        "Browse tickets for Chicago Bears games.": 0,
        "Show events in Los Angeles and select the one on the Friday this weekend.": 0,
        "Find the most expensive ticket for New York Knicks game on April 9": 0,
        "Book a WWE ticket for price range between $50 to $100.": 0,
        "Find the list of off-Broadway theatre shows on April 19": 0,
        "Show MLB tickets for this weekend and select the next one.": 0,
        "Go to the list of ballet event for the next 30 days.": 0,
        "Show me all NFL tickets": 0,
        "Buy two tickets for the Boston Red Sox vs. New York Yankees game on August 18th, with a total cost of no more than $200.": 0,
        "Check if there are tickets availabe for the  Hamilton musical in Richmond, VA.": 0,
        "Select a ticket for an event similar to professional boxing": 0,
        "Browse the venues that are playing the Wicked show from Oct 5 to Oct 24 2023": 0,
        "Find tickets between $200-300 for next Amy Grant concert": 0,
        "Find the mobile delivery tickets for the up coming event on march 23th at Columbus with low cast.": 0,
        "Find upcoming NBA games of the Miami Heat and book the 5 level 320 tickets for Sunday, April 16.": 0
    },
    "nfl.com": {
        "Find the year that Tom Brady had the most touchdowns in a single seasson.": 0,
        "Watch the halftime show from the most recent Super Bowl": 0,
        "Find the schedule for the San Francisco 49ers.": 0,
        "Find the retired players named James Smith": 0,
        "Find the kicker with the most made field goals in the 2022-2023 NFL season.": 0,
        "Find the score of the 2020 Super Bowl.": 0,
        "Find the video highlights of the most recent Super Bowl.": 0,
        "Find the latest news article and send an email about it.": 0,
        "Find the current NFL standings for the AFC East division and determine which team is in first place.": 0,
        "Show me the scores for the 2019 super bowl": 0
    },
    "thetrainline.com": {
        "Get the cheapest return tickets from Leeds to Sheffield leaving at 8:30 am on Mar 25, 2023 and returning at 23:00 pm on same day for 1 adult and 2 child.": 0,
        "Book a journey with return option on same day from Edinburg to Manchester on April 2nd and book the best possible option available.": 0,
        "Change the language to UK English and the currency to Euros": 0,
        "Find the Trains in Spain guide that will help you learn about Renfe fare types": 0,
        "Book a lowest priced ticket from Bristal airport to London Paddington on April 8 after 2 pm, seating must be forward facing window side with power socket.": 0,
        "Find tickets from Edinburgh Waverly to Glagsgow Central on May 18, leaving nearest 3PM for 1 adult with a Veterans Railcard": 0,
        "Find tickets from Manchester Piccadilly to any station in London on April 8, leaving nearest 10 AM for 1 adult": 0,
        "Book a cheapest train ticket in upstairs deck and at least one window seat from Paris to Milan on March 26, departing after noon for 16 year old and 45 year old.": 0,
        "Find a cheapest standard train ticket from London to Sheffield on March, 29, arriving by 10:45 am for 2 adults.": 0,
        "Find the Railcard options for a 20 year old couple traveling within London and the South East": 0,
        "Reserve a train ticket with seat from Berlin to Zurich on March 31 after 8 am in aisle quite zone in side by side seat formation.": 0
    },
    "ryanair.com": {
        "Show me all the destinations in Armenia, Austria, Belgium and Bulgaria in Alphabetical order": 0,
        "Buy two 100-pound digital gift cards with a birthday card and message of Happy Birthday Love from Stewart Bloom, send  to Denise Bloom on email id denise.bloom@bbt.com and Debbie Wolowitz on email id debbie.wo@bbt.com.": 0,
        "Find the cheapest event to attend in Athens, Greece on April 2nd": 0,
        "Hire a large car with air conditioning for a small group to pick up from Berlin on May 15, 11:30 am, and drop off at the exact location on May 16, 11 am, book with full protection and payment with a credit card.": 0,
        "Book the cheapest available hotel for a three night stay from 1st June in Jakarta. The guest is named Joe Bloggs with the email address of buckeye.foobar@gmail.com and phone number of 11111111111. Billing address is in New York, zip code 10001\n.": 0,
        "Search for a flight on May 9 and return on May 16 from Tel Aviv to Venice with plus type fare option.": 0,
        "Find the cheapest room for Athens, Attica, Greece 1 Apr 2023 - 3 Apr 2023, 2 nights, 1 Room, 1 Adult": 0,
        "Use the FareFinder to find flights for $150 or less from Dublin to anywhere.": 0,
        "Find a flight From Dublin To Athens Greece for 1 Adult that leaves on April 1 and returns April 5th.": 0,
        "Book a one way ticket from Faro to Bournemouth leaving on 30th April, with a value fare, for a passenger named Mr. Joe Bloggs. Don't select now and  only take 1 small bag onboard.": 0,
        "Find top-rated outdoor activity events in Spain, that is happening on May 1 and book the tickets for two adults in morning group with an English guide.": 0,
        "Find a fully electric car pickup at Athens Airport (ATH) Sat, Apr 1, 2023 and return to the same palce at Mon, Apr 3, 2023.": 0,
        "Search for a flight from Dublin in Ireland to Paris Beauvais in france for 2 adults leaving apr 26 and returning may 2 with the promo code 10000001": 0,
        "Get a rental car to pick up at Paris Charles de Gaulle Airport CDG on april 13  at 10 am and drop off on april 18 at the same time": 0,
        "Check the availability of 2 adult and 2 child tickets for most popular FamilyFriendly Event in Denmark on 25th march.": 0,
        "Find a flight from Dresden to anywhere under $100": 0,
        "Book two rooms for four adults in a 5-star hotel with pool, minibar, bathtub, and spa facilities, that are nearest to the city center in Dubai from June 13 to 16.": 0,
        "Find a hotel in Dublin, Ireland for May 2nd to May 8th for 2 adults and 1 room.": 0,
        "Show me tickets for food and drink attractions in Ireland from April 11 to April 12": 0,
        "Search for a one way flight from Dublin to Malta on April 22, 2023 for 2 adults.": 0
    },
    "ultimate-guitar.com": {
        "Find highest rated chords for the song La Bomba": 0,
        "Find forum threads which include the name Taylor Swift in the title within last month": 0,
        "Find all time popular drop c rock tab of beginner difficulty": 0,
        "Open the profile page for author of latest shot": 0,
        "Filter search results for guitar tabs to only show songs with a difficulty rating of \"Beginner\"": 0,
        "Find recently added guitar pro non-acoustic tab intros": 0,
        "Add the best rated ukulele tab to my favorites": 0,
        "Find the highest rated Drop D guitar tab from the 1990s.": 0,
        "Show me Ed Sheeran Chords & Tabs": 0,
        "Show me all the artists with smith in their name": 0,
        "Find the most popular guitar tab for Absolute Beginners.": 0,
        "Add the most most popular of all time tab to a playlist": 0,
        "Find the \"Rock And Roll Over\" reviews": 0,
        "upvote a comment on the most relevant kiss chords & tabs": 0
    },
    "enterprise.com": {
        "Select the cheapest exotic car for two from Beverly Hills at 11 am on March 31 and return on the same day at 5 pm.": 0,
        "Browse a list of convertible cars for sale under 20000.": 0,
        "Find a Hotel in Boston zip code 02199 and make a pick-up reservation in a suv with gps for 2 people on March 27 11 am and return on March 29, 1 pm.": 0,
        "Reserve a lowest priced car for pickup from Birmingham Airport, Alabama, at 11 am on March 22, 2023, and the return location is Montogomery Airport, Alabama, at 5 pm on March 25, 2023.": 0,
        "Browse a list of rental vehicles for Brooklyn, OH, US for 18 year old renter.": 0,
        "Find a vehicle at New York JFK International Airport May 2-May 5 for an owner above 25 years.": 0,
        "What are the exotic vehicles they have available to rent?": 0,
        "Find the lowest rent truck for 4  people,  pick up from  JFK airport at 11 am on March 27 and return at noon on March 30.": 0,
        "Find the booking with ticket 123456 under the name James Buck.": 0,
        "Sign Allan Smith for email offers with the email allan.smith@gmail.com and zip code 10001": 0,
        "Find a mini van at Brooklyn City from April 5th to April 8th for a 22 year old renter.": 0
    },
    "cvs.com": {
        "Browse benadryl items for Allergy Treatments in Liquid form.": 0,
        "Locate the cvs pharmacy nearest to zip code 45201 that provides hair loss evaluation and treatment.": 0,
        "Read the 1 star reviews of DayQuil Severe Cough Liquicaps.": 0,
        "Browse the weekly ad in List View.": 0,
        "Find a comprehensive health screening for women in 10003.": 0,
        "Add cheapest vitamin C and D to cart.": 0,
        "Add a CVS brand covid home test kit to the cart.": 0,
        "Add zyrtec to the cart for pickup at the nearest CVS to zip code 90028": 0,
        "Find Hair Loss Evaluation and Treatment in 10018 and show directions.": 0,
        "Browse cough medicine that is rated 4 stars and above and is $15-$20.": 0,
        "Look up information on the potential side effects of rogaine.": 0,
        "Find the location and operating hours of the nearest CVS pharmacy to zip code 90028": 0,
        "Add to cart 2 bottles of vitamin D that are buy 1 get 1 free and new arrival.": 0,
        "Start the process to sign up for CVS ExtraCare": 0,
        "Schedule COVID-19 test appointment at 90028.": 0,
        "Show weekly deals of Columbus, Oh 43215 store.": 0,
        "Signup for virtual healthcare visit.": 0
    },
    "aa.com": {
        "Find flights from Chicago to London on 20 April and return on 23 April.": 0,
        "Search for developer jobs in Dallas, Texas, and review details of the latest job then create an 8-day alert after signing in.": 0,
        "Book a first class vacation travel for 2 adults from San Francisco to New york leavind on april 9 and returning on april 19": 0,
        "Check refund status for John Davis for ticket no. 1234567890123": 0,
        "Request ticket receipt for ticket no. 1234567890123 and last name Davis": 0,
        "Check flight status from London to New York City for next day.": 0,
        "Find the cheapest hotel in New York City for 2 adults from Apr7 to Apr 8.": 0,
        "Get email alerts for a flight from BHZ to EWN leaving on april 30 on the email lin.lon@gmail.com": 0,
        "Search for the flight status for the flight 12345678 leaving on april 7": 0,
        "Find the lowest travel time flight for 1 traveler from JFK, NYC to Heathrow, London on April 19, then from Heathrow, London to CDG, Paris on April 21 and then from CDG, Paris to JFK, NYC on April 23": 0,
        "Show me the Flight schedules and notifications for a flight outside the us from BHZ to EWN leaving on april 30": 0,
        "Check status of flight 6944 on April 6": 0,
        "Find the lowest fare for JFK, NY to Heathrow, London and nearby airports for 1 adult on April 22, one way": 0,
        "Find jobs available in Texas for American Airlines.": 0,
        "Check my trip for Smith and booking number X899987799.": 0,
        "Check the status of a flight between San Antonio, Texas, and Bellingham, Washington  on April 8.": 0,
        "View travel credits for the passenger Leon Sin with the record locator jcqnhd ans ticket number 1234567": 0,
        "Book the lowest-priced and quickest flight for 5 adults and 1 child on May 20 from Mumbai to any airport near Washington.": 0,
        "Find a flight for three adults from New York to New Orleans on April 14, return on April 16.": 0
    },
    "parking.com": {
        "Find parking near Venice Beach that allows mobile coupons.": 0,
        "Find parking near Disneyland that has EV charging.": 0,
        "Find out what payment methods are available for monthly parking.": 0,
        "Find parking spaces near Warner Theatre in Washington DC.": 0,
        "Add a parking button code for my company Boston Legal located near Boston Navy Yard, and the button should be 160x400 pixels, and the parking spot should be within 15 miles of my address.": 0,
        "Show cheapest monthly price for parking near Shubert Theatre.": 0,
        "Find the list of Museums in New York City.": 0,
        "Browse monthly parking rates near the Museum of Modern Art.": 0,
        "Search for parking near Sofi stadium that allows to pay with phone.": 0,
        "Search for a parking garage near Thalia Hall in Chicago that offers pre purchasing.": 0,
        "Book the cheapest parking spot for a standard car near 66 Perry St.,  New York, from April 20, 5:30 pm to April 21, 5:30 am.": 0,
        "Book parking spot for James SMith at Stewart Hotel in New York for 2 hours. The street address is 133 st avenue in New York. Zip code is 10001 and phone number is 888888888. The email address is buckeye.foobar@gmail.com. Employer's name is Gua AB.": 0,
        "Find motorcycle parking near Radio City Music Hall.": 0,
        "Browse events happening at Madison Square Garden.": 0,
        "Find parking in New York City from June 5th to 9th.": 0,
        "Search for parking near restaurants in Boston and find a parking spot near Hard Rock Cafe for an oversized car from 9 to 11 pm on May 11, and ensure that the pre-purchase and open gate with phone option is available.": 0,
        "Look for outdoor parking in Arlington, Virgina near 5601 Chapin Ave, Alexandria, where I can pay with my phone and charge my car on April 27 from 10 am to April 28, 10 am.": 0,
        "Find the cheapest parking spot in 10001.": 0
    },
    "viator.com": {
        "Find the longest private sightseeing trip of India in the month of June": 0,
        "Find on the water activities in Dubai from 5pm to 12am with a maximum duration of four hours": 0,
        "Show me a list of tours available at the Coliseum with free cancellation.": 0,
        "Find the longest skiing activity in August 10": 0,
        "Show me things to do nearby in Mar 30, 202\n3": 0,
        "Find highest rated white water rafting experience available in Montana from May 1 to May 7": 0,
        "Mark a review in the best rated activity to do in Paris in May 12, 2023 as he\nlpful": 0,
        "Find cheapest food tour in Paris which offers free cancellation": 0,
        "Find ideas and recommendation for things to do in Cancun.": 0,
        "Find unique experiences in London of maximum one hour duration which are rated four stars and above": 0,
        "Browse Tokyo's best tea related attractions in the morning.": 0,
        "Book the cheapest likely to sell out activity in Los Angeles on April 2": 0,
        "Add to my wish list the highest rated activity in Amsterdam.": 0,
        "Find a list of Tours that contain visits to the Louvre rated 5 stars": 0
    },
    "nyc.com": {
        "check bookstores available in Chelsea area": 0,
        "search for restaurant that offers African Cuisine in east village under $30": 0,
        "with a $200 budget check available in central parkto check in on 24th to 27th march  for 2 adult and a toddler less than a year old.": 0,
        "check all available tickets within $100 to $200 for the New York Knicks first game on April2 nd.": 0,
        "book a tour to the statue of liberty for 3 adult on march 27th": 0,
        "List of Broadway events sorted by date.": 0,
        "check reservation availability for an Indian restaurant with price below $30 in East village": 0,
        "check the lowest price ticket for All star stand up comedy event happen 6pm on the 25th March 2023.": 0,
        "review the dinner menu of La Bergamote restaurant in Hell's Kitchen.": 0,
        "search for art galleries in midtown": 0,
        "check available hotels with one room for two adult in Harlem less than $200 to check in on Mar 17th and check out on Mar 20th": 0,
        "Find 2 tickets to see the New York Yankees play on March 30, 2023 and filter to show price including fees.": 0,
        "Show me the best city tours.": 0
    },
    "travelzoo.com": {
        "Show me the highest rated Last-Minute Flights & Car Rentals": 0,
        "find cruise deals to Europe this summer that includes airfare and are all-inclusive.": 0,
        "Get the cheapest last-minute pet-friendly road trip hotel deal in May for a single person with a pet and book.": 0,
        "Find adults only, airfare included vacations in Mexico during the month of May": 0,
        "Find the cheapest last minute cruise deal": 0,
        "Find a luxury trip deal anywhere to go in spring": 0,
        "Find hotel deals in Las Vegas for four adults starting on May 17 and ending on May 20, and if deal is not available, set an alert for the same.": 0,
        "Show most expensive cruise deals in Europe and Mediterranean.": 0,
        "Show me the most expensive things to do anywhere in December in a map": 0,
        "Find deals for Hotels in Mexico.": 0,
        "Find guided vacations in Europe for more than 10 nights in the month of July": 0,
        "Show me hotels in New York city to stay in during spring": 0,
        "Find the highest-rated adults-only romantic beach vacation deals and book the cheapest one.": 0,
        "Find highest rated romantic summer vacations in Spain": 0,
        "Select a deal which is highly rated in Fiji location.": 0,
        "Find the cheapest Disney theme parks with water rides and reserve the deal.": 0,
        "What are the cheapest hotel options for a luxury trip in Chicago during summer": 0,
        "Search for the best-rated multi-city 10+ night European cruise deal under 999 dollars and book.": 0,
        "Find adventure cruises under $999 for Alaska": 0
    },
    "delta.com": {
        "search for SkyMiles domestic Award Deals from Philadelphia to Atlanta.": 0,
        "Check Flight status on 21 April for flight number DL145.": 0,
        "Find premium car in Brooklyn for a day.": 0,
        "Find a flight from Mumbai to New York City on 21st April, 2023.": 0,
        "check flight status with flight number 2819 on 18th of March.": 0,
        "Find a cheapest hotel in New Delhi for 3 days starting from April 24 and add 3 to list.": 0,
        "Find a hotel in Ohio From July 2nd to July 8th for 2 adults.": 0,
        "Find my trip with ticket number 3329456534543 along with my name John Green": 0,
        "Check for travel requirements when travelling from New York to Tokyo as US citizen.": 0,
        "find my trip with confirmation number SFTBAO including first and last name Joe Lukeman": 0,
        "Find the status of March 25 flights from New York airports to Columbus in Ohio.": 0,
        "Check all available one way flights for a single passenger from Manhattan to Philadelphia on May 23rd in first class.": 0,
        "Find flights from Seattle to New York on June 5th and only show those that can be purchased with miles.": 0
    },
    "koa.com": {
        "Search for holiday campground in Alaska.": 0,
        "Find all campgrounds located in California.": 0,
        "Find a KOA campground in California that has RV sites.": 0,
        "Search for KOA near Lansing, Michigan for June 7, 2023 to June 12, 2023.": 0,
        "Find a campground in Phoenix with wi-fi to check in today.": 0,
        "Show the hot deals within 500 miles from 10001": 0,
        "Show me the Lava Hot Springs East KOA photo gallery.": 0,
        "Get directions for the Koa resort campground in Arizona": 0,
        "Renew a existing KOA rewards account with the rewards number 1000000001 e postal code 10023": 0,
        "See what deals there are for Dish Outdoor.": 0,
        "Use the trip planner for a trip between Cheyenne, WY and Helena, MT.": 0,
        "Browse glamping locations in Northern California.": 0,
        "Browse hot deals near zip code 10019.": 0,
        "Browse Myrtle Beach sites with a hot tub for three nights starting on June 20th.": 0,
        "Find a campground in Orlando for 2 adults to check-in in mar 29 and check out in mar 30": 0
    },
    "espn.com": {
        "check the 2022 highest goal scorer in the MLS league": 0,
        "check Manchester City Performance Stats of 2022/2023 season in the champions league": 0,
        "Show me the Biography of the NFL player named Michael Jordan": 0,
        "Find FC Barcelona's next fixture in the Spanish Copa de Rey": 0,
        "Find the latest news about Mikal Bridges": 0,
        "Play a podcast about F1": 0,
        "Select an event from the 2019 UFC schedule and show me the full profile from one of the athletes": 0,
        "check the NBA score board on March 11th": 0,
        "Find the schedule for the Dallas Mavericks.": 0,
        "Find Kevin Durant's bio": 0,
        "Find Golden State Warriors Player List.": 0,
        "Show me the NFL Scoreboard from the superbowl 2015": 0,
        "Find the NBA team with the highest average points scored in the current season": 0,
        "Show me the stats of the Athletic Club from spanish Laliga": 0,
        "Who were the NBA season leaders from the 2020-21 regular season?": 0,
        "Find the Real Madrid team schedule of the UEFA Champions League championship.": 0,
        "Follow one of the team leaders of one of the NHL teams from the Atlantic Division": 0,
        "Look up the scores for the previous day's NBA games": 0,
        "Find the statistics of the player Cristiano Ronaldo for the national team of Portugal in all the world cups.": 0,
        "Check the Italian Serie A Schedule fixtures on April 8th 2023": 0,
        "What are the upcoming soccer events on ESPN2?": 0,
        "Find the team schedule of the Brooklyn Nets": 0
    },
    "airbnb.com": {
        "Look for a place with a good swimming pool that charges between $200 and $300 per night.": 0,
        "Find a treehouse in India with free cancellation and below $100 per night.": 0,
        "Add 3 places from OMG! below $500 to Wishlist and name it \"Togo\".": 0,
        "Search for a tiny home anywhere for an adult and 2 pets to stay in from april 10 to april 12": 0,
        "Search for Castles in Europe for a week next month and price below $1000 per night.": 0,
        "I want to see mansions for 3 adults to stay in in europe during any month": 0,
        "Favorite a shared room in Belo Horizonte costing up to $100 to stay in a weekend in May": 0,
        "Find a private room in New York for 1 April and checkout on 2 April for 2 adults": 0,
        "Find morning sports experiences in english for one adult and 2 children in portugal on may 2": 0,
        "Show me cooking online experiences for 4 people on  may 10": 0
    },
    "redbox.com": {
        "Find the newest movies for rent  in the Redbox kiosk at any Winn Dixie in Daytona Beach.": 0,
        "Find $1 movie night film and rent blockers": 0,
        "Play the Wakanda Forever trailer": 0,
        "Find the software requirements for iPhones that support live tv  on demand streaming.": 0,
        "Add 3 movies from At the Kiosk which are new to Wishlist.": 0,
        "Rent \" The Whale \" movie on demand with format \"high definition\".": 0,
        "Browse newly released movies and filter by genre to find a comedy to rent.": 0,
        "Find devices that support Live TV  on demand streaming.": 0,
        "Add the movie \"The Shawshank Redemption\" to your wishlist.": 0
    },
    "usps.com": {
        "Book an appointment for applying new passport for one adult, Ellen Walker, with phone number 123-456-7890 and email address EW@gmail.com on April 4, 2023 at 1 pm in the post office nearest to zip code 60505. Don't send updates via text message.": 0,
        "Find a list of domestically restricted items and a list for mailable gases for shipping.": 0,
        "Find the nearest location to zip code 54620 that offers size 4 P.O. Boxes.": 0,
        "Calculate the price to ship a large flat rate box from 77449 to 77084 at the first available date and time.": 0,
        "Update the quantity to 5 for the  Souvenir sheet in the shopping cart.": 0,
        "Find the closest post office within 10 miles of zip code 90210": 0,
        "Order Priority Mail padded envelopes": 0,
        "Track a package that is out for delivery with tracking number 90019847161684486.": 0,
        "Find a  post office for within 50 miles of zip 84043, if more than one found than sort it on general delivery, passport appointment, and greeting card service availibiliy and view the details of that post office.": 0,
        "Find political every door direct mail service in zip 04401, choose the top 5 routes with the most residences, and checkout.": 0,
        "Find a self service kiosk within 10 miles of zip code 10019": 0,
        "Buy the latest USPS cars and truck toys as a gift for my nephew, and add the top-most result in the cart and check out.": 0,
        "Calculate retail flat rate boxes postage prices of the parcel to be sent from zip 46298 to 06057 between 11 to 11:30 am on 14 April, and choose large flat rate priority mail box with certified mail and return receipt.": 0,
        "Buy a book of 20 Forever Stamps": 0
    },
    "umich.edu": {
        "Find the way to give a gift to UM-Dearborn": 0,
        "Find the internships/Research opportunities in summer that are off campus.": 0,
        "Find registration deadlines for fall 2024 academic term": 0,
        "Find tuition & fees for full term graduate students in the college of engineering for the academic year 2022-2023": 0,
        "Find the time and location of the first available Campus Tour in April 2023 for First-Year Prospective students": 0,
        "Check whether there is any Undergraduate Information Session for First-Year Direct Entry into the bachelor school of nursing program": 0,
        "Search for LSA courde Guide": 0,
        "Get the information of Tution Fees for a full time course for undergrad study in college of Engineering": 0,
        "Find the list of undergraduate majors and degrees for the schools of public health and public policy": 0,
        "Find the results of the Michigan vs. Colorado State football game played on Sep 3rd": 0,
        "Find the list of men's soccer camps and clinics": 0,
        "Find the list of exhibitions, workshops and seminars at the museum of art from April 5 to April 12": 0,
        "Find the Arrest and Citation Statistics from the University of Michigan Division of Public Safety and Security (DPSS)": 0,
        "Find the registration deadline(s) for Academic Term Fall 2024": 0,
        "Find the tuition rates for the 2022-2023 Academic Year, College of Pharmacy, Full Term, Undergraduate Level of Study": 0,
        "find the Event Description of NIKE Basket Ball Camps at crestwood High School": 0
    },
    "allrecipes.com": {
        "Open the reviews of a recipe with beef sirloin.": 0,
        "Find the latest Recall news and share it on Twitter.": 0,
        "Find a 30 minute recipe and save it.": 0,
        "Find the Nutrition Facts of Spicy Chicken Noodles": 0,
        "Search for a recipe that uses the ingredient cinnamon": 0,
        "Find an Easter Brunch recipe with over 500 ratings.": 0,
        "Open the latest food trends article.": 0,
        "Find a list of air fryer recipes and share it on Pinterest.": 0,
        "Find 30-minute main dishes containing seafood.": 0,
        "Show me a list kitchen tips for food safety.": 0,
        "Search for a dessert recipe that uses pumpkin as the main ingredient and has a high rating from other users.": 0,
        "Find a 5 star pork recipe and favorite it.": 0,
        "Search for a recipe for Lemon Bar with the most number of ratings.": 0,
        "Find a 5 star Filipino dessert recipe.": 0,
        "Browse recipes that has sweet potato as the main ingredient.": 0,
        "Save a coffee mocha recipe.": 0
    },
    "healthgrades.com": {
        "Browse optometrists who offer telehealth services": 0,
        "Find a dentist who specializes in pediatric dentistry and is located near zip code 90210 (within 5 miles distance\n).": 0,
        "Find a neurosurgeon who is over 50 years old and has an appointment available within 2 weeks.": 0,
        "Find telehealth resource center for womens health uti treatment birth control in New Orleans, and sign up for the newsletter with my email: buckeye.foobar@gmail.com": 0,
        "Find a psychiatrist who offers virtual appointmentsthat has experience with treating neurodevelopment disorders and accepts new patients.": 0,
        "Browse primary care doctors who are within 1 mile of distance": 0,
        "Browse dentists 10 miles near zip code 90028 and filter by 4 stars and up": 0,
        "Find the closest 5-star rated dentist to zip code 98011": 0,
        "Check reviews of SSM Health Cardinal Glennon Children's Hospital.": 0,
        "Find acupunctures within 50 miles from Mountain Pass, CA that accept Blue Cross Blue Shield PPO insurance plan.": 0,
        "Find the highest-rated doctor for knee replacement near Glendale, New York, who is between 40-50 years of age, is available within 2 weeks, and can converse in Chinese.": 0,
        "Look for the closest hospital near me for urgent care within 10 miles of New York, and view the profile to discover the contact number.": 0,
        "Browse dermatologists 10 miles near zip code 10019 and filter by only those who accept Medicare": 0,
        "Find side effects of Viagra Drug.": 0,
        "Take help from the depression appointment guide for an undiagnosed person for an in-person clinic visit within 1 mile of Denver, Colorado, the doctor must be a female with a 5-star rating and who accepts Cigna health insurance.": 0,
        "Find a primary care physician is within 1 mile from the city center of Chicago.": 0,
        "Find a Hospital for Bariatric Surgery with good ratings.": 0,
        "Browse pediatricians near zip code 90028 who specializes in Internal Medicine and has a rating of at least 4 stars.": 0,
        "Browse primary care physician who are accepting new patients, rated above 4 stars, and specialize in internal medicine.": 0,
        "Browse dermatologists in Columbus, OH who speak Spanish and is available for an appointment tomorrow.": 0,
        "Find neurologist in New York with highest rating.": 0,
        "Find a nearby doctor with a 5-star rating for allergy-related problems and initial consultation within 10 miles of Stamford, Connecticut, and schedule an appointment on April 13, 11 am, for which I am paying. My date of birth is 1995-05-05": 0
    },
    "cookpad.com": {
        "Show me recipes for pancakes with wheat and without beetroot.": 0,
        "Show Handy Cooking Tips and add Heart Reaction to 3 Tips.": 0,
        "React to a cooksnap with a heart": 0,
        "Browse recipes for gluten-free chocolate chip cookies that can be made without nuts.": 0,
        "Print a recipe containing shrimp.": 0,
        "Publish a tip that While Frying Onions adding salt will make it brown faster.": 0,
        "Find a recipe for Fried Bombay Duck and Save it.": 0,
        "Save a hamburger recipe.": 0,
        "Find a recipe for pad thai and print it": 0,
        "Find a recipe for vegetable soup and then follow the author of the recipe.": 0,
        "Find a recipe that includes eggplant and mushrooms.": 0,
        "Find the app for android.": 0,
        "Leave a comment on a recipe for chicken parmesan, asking if it can be made in an air fryer.": 0,
        "Find dinner meals containing lamb.": 0,
        "Show me a list of recipes that contain chicken, but without rice.": 0,
        "Leave a comment on a recipe for orange shrimp skewers: \"It's good to use orange on shrimps!\" and share the recipe on twitter.": 0,
        "Find Indian Community and check for recipe with a vegetable that is in season.": 0
    },
    "petfinder.com": {
        "Show me the list of Abyssinian female cats available for adoption.": 0,
        "Find cats available for adoption with 10 miles of zip code 94587, Young or Adult age cat, sorted by Oldest Addition": 0,
        "Find a male rabbit of American breed near New York and copy the share URL link.": 0,
        "Find young cats in Seattle and show off newest additions.": 0,
        "Find a list of shorthaired dogs available for adoption with 100 miles of zip code 94587 that are good with kids and cats, and have been on Petfinder for over 30 days": 0,
        "Copy to clipboard the Share link for the Woody Feral Cat Support Group in Union City, CA": 0,
        "Find American Bulldog within 50 miles of 10001.": 0,
        "Find large dogs available for adoption in Toronto.": 0,
        "Show me the adult Afghan Hounds available for adoption.": 0,
        "Find the page with information about Dog and Puppy Grooming.": 0,
        "Sign up to give a $10 monthly donation to Petfinder Foundation using credit card number: 5555555555555555, Expiration date: 12/2036, Security code: 555, Name: Jane Doe": 0,
        "Add a rabbit available for adoption within 100 miles of zip code 94587 to Favorites": 0,
        "Get the email contact address for the adoption center Kitten Tales Rescue in California.": 0,
        "Find British Shorthair adult cats that are available for adoption nearest to  Naperville, IL.": 0,
        "Find male black Labrador Retriver.": 0
    },
    "theweathernetwork.com": {
        "Show a severe climate alerts for US.": 0,
        "Find the hours of sun for Vancouver, British Columbia for the next seven days.": 0,
        "Get details of severe weather alerts in place for Novia Scotia, Canada.": 0,
        "Find the latest climate news.": 0,
        "Check the current wind speed in Calgary, Alberta.": 0,
        "Open Vancouver Area Highway Conditions.": 0,
        "Show me the weather forecast in Allenford during the weekend.": 0,
        "Find the humdity percentage for zip code 90028 for the next 36 hours.": 0,
        "Show UK weather warnings map.": 0,
        "Show me severe weather alerts for Canada.": 0,
        "Look up the current temperature for zip code 10019.": 0,
        "Find the weekend forecast for zip code 10019.": 0,
        "Add Miami, FL to your locations.": 0,
        "Check weather for 7 days at night for Vancouver, BC.": 0,
        "Browse the Storm Hunters video gallery,": 0,
        "Show calendar of this month for Brooklyn, NY.": 0
    },
    "accuweather.com": {
        "See the monthly forecast for Atlanta, GA.": 0,
        "Check the health risk for sinus pressure  and the condition for running for today in Tokyo, Japan.": 0,
        "Show me the wind flow map for Belo Horizonte": 0,
        "Show me the monthly weather forecast for florida city": 0,
        "Show health activities for Mumbai, India.": 0,
        "Find the weather radar map for Miami.": 0,
        "Show daily weather for New York City.": 0,
        "Find the overnight forecast for next Thursday in Reno Nevada.": 0,
        "Find the active storms and the current status": 0,
        "Check the daily forecast in Madison, WI from March 21 - April 1, 2023.": 0,
        "I want to see the past hurricanes in the indian ocean in 2020": 0,
        "Play a past episode of one of their podcasts": 0,
        "Check the hourly forecast for Boston.": 0,
        "Look up the pollutants of New York City.": 0,
        "Find out the wind speed and humidity in Tallahassee, FL for today.": 0,
        "View probability of Migraine in Salt Lake City, UT for the next week.": 0,
        "find the Monthly forecast for Manchester, GB for May": 0,
        "Check the minutecast for Los Angeles.": 0,
        "View the wind flow map for Utah, the  United States without contours.": 0,
        "Find the SO2 air quality over the last 24 hours for Maine North, County Cork, Ireland.": 0
    },
    "adoptapet.com": {
        "Find a shelter or rescue group near zip code 90011.": 0,
        "Find a nationwide nearest animal shelter for birds around zip 10012.": 0,
        "Find a male cat in 75209 zip code and add to favorite.": 0,
        "Find information about which breed will be best for Hypoallergenic person.": 0,
        "Search for adoptable pets near 21122 zip code.": 0,
        "Search a young spayed male dog cared by a private owner within 50 miles of zip 33109.": 0,
        "Create a free alert for a Jack Russell Terrier dog near zip code 10019 sending to buckeye.foobar@gmail.com": 0,
        "Find a white female kitten within 35 miles of zip 77494.": 0,
        "Browse senior spayed/neutered dogs near zip code 90028.": 0,
        "Find a bulldog near zip code 90028 that was cared for by a private owner.": 0,
        "Find white young male german shepherd dogs within 50 miles of zip 78613.": 0,
        "Find an adult husky near zip code 10019.": 0,
        "Search for Mainecoon cats near zip code 21122.": 0,
        "Set a alert for Belgian Shepherd Dog for 10017 zip code with abc@abc.com.": 0,
        "Find a male senior boxer near zip code 90028.": 0,
        "Find a shelter for rabbits and small anmimals within 100 miles of zip 77084.": 0,
        "Browse Siamese cats within a 50-mile radius of 90028.": 0
    },
    "epicurious.com": {
        "Find the latest recipe for gluten-free bread made with rice and grain.": 0,
        "Find the newest vegeterian dairy free recipe for summer and save it.": 0,
        "Find one pot meal Indian curry recipe for dinner, which has potato and chicken as main ingredients.": 0,
        "Find chicken recipes with the highest ratings.": 0,
        "Find a quick and easy European chicken bruch recipe sorted by make again percentage.": 0,
        "Find a most reviewed dairy free pasta recipe, which can be prepared from 5 or less ingredients and save it.": 0,
        "Browse chicken soup recipes that can be made with Instant Pot.": 0,
        "Browse vegan pizza recipes that take 30 minutes or less.": 0,
        "Browse Halloween dishes sorted by rating.": 0,
        "Find pie recipes and show the best rated ones.": 0,
        "Find burger recipes that use chicken as an ingredient.": 0,
        "Open expert tips on how to clean an oven.": 0,
        "Browse vegan lasagna recipes and sort by Highest rated.": 0,
        "Find articles about gluten-free desserts.": 0,
        "Add a recipe to your \"favorites\" list.": 0,
        "Find a gluten free recipe containing chicken.": 0
    },
    "coinmarketcap.com": {
        "Open the XRP yearly chart.": 0,
        "Find the list of all mineable crypto coins with a market cap between $100M-$1B whose price has increased between 0-100% and whose trading volume is more than $10M": 0,
        "Find Dogecoin price today and add to watchlist.": 0,
        "Vote that you're feeling Good about USD Coin today": 0,
        "List top NFT art collections on Ethereum during last 30 days and sort them by average price": 0,
        "Find the Tether's whitepaper.": 0,
        "Check the top dex exchange in BSC network that were recently launched": 0,
        "Download a JPEG image comparing the Dogecoin price to that of Bitcoin over the last year.": 0,
        "View the historical data of Litecoin for the last 90 days.": 0,
        "Find the ongoing crypto airdrops.": 0,
        "Convert $50 to dogecoin": 0,
        "Browse the list of spot exchanges sorted by 24-hour trade volume.": 0,
        "Filter the list of cryptocurrencies by reputation and select the one with the highest % change in the last 24 hours.": 0,
        "check the top trending coins within the last seven days": 0,
        "Search for Cardano and follow it.": 0,
        "Find the list of upcoming Ethereum Eco ICO's": 0,
        "Show holders data for 3 months for Bitcoin.": 0,
        "Show me the list of NFT Upcoming Sales.": 0,
        "Find all exchange events starting from April 17": 0,
        "Calculate value of 1 Ethereum to USD.": 0,
        "Add Tether to the main watchlist.": 0
    },
    "finance.google.com": {
        "Find key events of Microsoft stock.": 0,
        "Find the 5 Day price chart for Bitcoin.": 0,
        "Create a new watch list called AI Stocks": 0,
        "Find the stock price for WWE over the last month.": 0,
        "Use the search function to find the current stock and percentage change of AMC stock": 0,
        "Check Europe market of 1 Year chart.": 0,
        "Add Tesla stock to watchlist.": 0,
        "Find current price and follow Euro currency.": 0,
        "Add Google stock to a watch list.": 0,
        "Follow 1 stock from the gainers list.": 0,
        "Create a new portfolio called AI and add one AI stock to it.": 0,
        "Browse the climate leaders stocks": 0,
        "Follow Walt Disney stock.": 0,
        "Compare Tesla and Ford stocks over the past 6 months": 0,
        "Find the latest news about Netflix stock": 0,
        "Find the 1 month stock price chart of AMC.": 0,
        "Find a list of climate leaders and share it on Twitter.": 0,
        "Check price of Ether and compare with Bitcoin.": 0,
        "Find the key events from for the top stock in the Losers list.": 0,
        "Create a new portfolio called Tech Stocks and add Microsoft with quantity of 1\n to it": 0
    },
    "ohiomeansjobs.ohio.gov": {
        "Find\n job postings for an auto mechanic within 20 miles of Delaware, ohio.": 0,
        "Find an internship in the science and technology industry for a bachelor in Dayton and save the top job.": 0,
        "Browse marketing jobs and filter by Bachelor's Degree education level": 0,
        "Look for a part-time job in Amazon delivery station in Columbus for delivery services and save this job to my profile.": 0,
        "Browse web design jobs and filter by Entry level": 0,
        "Find a permanent job in Logistics within 20 miles of New York, zip 11005, in the middle-income range for a high school diploma holder.": 0,
        "Browse part-time waiter jobs.": 0,
        "Browse IT jobs and filter by Security clearance certificate": 0,
        "Find a Job Center in Jefferson County": 0,
        "Get a part-time job within 5 miles of Moscow, Idaho in the hotel and food industry, as a chef and head cook, and show jobs for corporate only.": 0,
        "Find a workshop program for preparing interview": 0,
        "Find a government job in the education industry as a teacher in Dayton, Ohio and apply.": 0,
        "Browse jobs involving dogs and filter by training oppourtunities": 0
    },
    "osu.edu": {
        "Show me the requirements for OSU health insurance.": 0,
        "How do I submit an application for IRB approval?": 0,
        "Find the page with information about Student Financial Aid.": 0,
        "Find a class for animal science in The ohio state university": 0,
        "Show me the schedule of the libraries.": 0,
        "Show me the Residence Halls photo gallery.": 0,
        "Open login page for online applications.": 0,
        "Check the Academic Calendar.": 0,
        "Find the cost of the Master of Science in Biomedical engineering course": 0,
        "I want to learn more about Venture Development.": 0
    },
    "webmd.com": {
        "Find the highest-rated practicing doctor for acute migraine treatment within 10 miles of Philadelphia, Pennsylvania, and find the contact details.": 0,
        "Help me identify a black round pill with 123 written on it": 0,
        "Find the ranking of Cardiology hospitals in Portland, Oregon, and view the best hospital chosen by patients, view all the physicians working in the hospital, and find the best-rated child neurology specialist.": 0,
        "Look for a doctor with Botox specialty in Bristol, Rhode Island, that is available for a virtual visit and accepts care credit, fill all the details for appointment on April 20. My name is James Smith, and I was born on 06/20/1990. My number is 456546546. My email is buckeye.foobar@gmail.com. The reason for my visit is consulation": 0,
        "Search for ovulation calculator and enter Mar 1 as the first date of period and calculate the date of ovulation and pregnancy test day.": 0,
        "I want to know information about the diagnosis of depression": 0,
        "Find the types of vaccination for children": 0,
        "What are the causes of Circadian Rhythm Disorder": 0,
        "Find the drug intraction of CHROMIUM": 0,
        "Compare the price of two medications for pain management": 0,
        "Find the best Audiologist within 50 miles of Jackson, Michigan, with a rating of 4 and above.": 0,
        "Browse the page with types of birth control.": 0,
        "Look for a Doctor for Stomach Pain in San Antonio.": 0,
        "What is the treatment for the pediatric condition clubfoot?": 0,
        "Show me the user reviews for a drug for Herpes zoster": 0,
        "Find a best physician for kidney stone removal specialized on nephrology within 0-4 miles of Austin, Teaxs, who is rated 5 and above.": 0,
        "Find the page with information about tests for food allergies.": 0,
        "Search symptoms for 30 year old woman with toothache.": 0,
        "Search for the interactions between ibuprofen and aspirin.": 0,
        "Find symptoms of sleep apnea": 0
    },
    "reddit.com": {
        "Show me the top comments regarding amazon on reddit": 0,
        "Find and upvote the newest comment about football on the r/news community": 0,
        "Show me the currently popular posts in Japan.": 0,
        "Join gift card exchange group and save the post which has Amazon Gift card in exchange\n.": 0,
        "Find the post for the Talk to Me trailer on r/movies and send an award.": 0,
        "Find a latest post with more than 10k upvotes in r/announcements community and upvote it.": 0,
        "Join a fitness community.": 0,
        "Join the r/politics subreddit.": 0,
        "Find and join a community for blind people on reddit": 0,
        "Find 12 monkeys community and view the latest posts mentioning James Cole": 0,
        "Find a community related to Music which have the highest viewers and join the community.": 0,
        "Open the tab to start a new conversation.": 0,
        "Find top comments mentioning Donald Trump": 0,
        "What are the top posts of all time on reddit?": 0,
        "Save a rising post on a community about work": 0,
        "Find the comments made by the user Separate-Camp7202.": 0,
        "Find and join community of Fortnite with most members.": 0,
        "Create a post on Cryptocurrency suggestions and save it as a draft with the content \"Please suggest crypto trading which is profitable.\"": 0,
        "Start and save as a draft a post titled \"Post\" with nothing written on it": 0,
        "Search for a comment about hip hop on the post about meme with the most  comments from the last week": 0,
        "Message the moderators of the community where the most relevant comment about cars comes from": 0,
        "Show me the posts with the most comments in the last year related to games.": 0,
        "Search for \"anti aging\" posts which has most comments.": 0,
        "Show me the rising posts on reddit in a compact form": 0,
        "Find rising popular posts using compact view": 0,
        "Find popular posts in Chile and copy link of the top post": 0,
        "Join the r/answers community and set the notifications as frequent": 0,
        "Create a private community named mycommunity": 0,
        "Find the top post of this month and downvote the oldest comment on it": 0,
        "Open AskReddit community and filter this month's top posts by Breaking News flair": 0,
        "Crosspost the newest post about nature on the NationalPark community as a spoiler": 0,
        "Show me the food posts on reddit with most comments": 0,
        "Follow the most relevant post from last year regarding covid": 0
    },
    "ups.com": {
        "Calculate shipping time and cost for package to be delivered from 96162 California to New York 10013 of 3lbs.": 0,
        "Find a UPS drop off point near miami in Florida": 0,
        "Request to receive an emailed transcript from a contact to UPS to the email I.contacted@gmail.com": 0,
        "Locate the ups store that offers notary public services and sells packaging supplies within 10 miles of zip code 60504.": 0,
        "Get a quote for fastest shipping available for 5lbs of package from New York 10001 to California 96162.": 0,
        "Get quotes for a 10lbs package Long Beach to Portland": 0,
        "Calculate the cost for a package from 10001 to 10023 shipping on april 10": 0,
        "Find the shiping cost of a Common medium sized box in flat rate shipping and compare with other parcel services": 0,
        "Go to the page to schedule a pickup in the US.": 0,
        "Track order number 123456 for US.": 0,
        "Search the Pickup Request Status for the Pickup Request with the Number 123456": 0,
        "Find a UPS Access Point near SPRING, TX and services provided by them": 0
    },
    "student.com": {
        "Show me the shared rooms in any university in chicago that has a private bathroom wifi, and gas included in the bills": 0,
        "View the rooms of the cheapest accommodation in London to move in in september and move out in october": 0,
        "Look for a lowest priced entire place of my own for booking in Glasgow, which has gas, heating, cleaning services and gym.": 0,
        "with a $100 to $300 budget search for student accommodation close to London business school with a no visa no pay cancellation policy": 0,
        "Find a property which is nearest to  Aston University.": 0,
        "Save 2 different properties with lowest price in San Diego to wishlist.": 0,
        "Browse housing options near University of California, Los Angeles that is rated at least 4 stars and included Wi-Fi": 0,
        "compare two rooms from the lowest  Student accommodation in Ann Arbor, university of Michigan North Campus": 0,
        "Find the facilities available in True Superior Apartment in Liverpool": 0,
        "Get a cheapest shared room to Taylor College in Sydney from September with at least 4 stars and heating facility.": 0,
        "Show me only properties with promotions in one of the universities in Sydney": 0,
        "Enquire about a group booking for 5 to 10 people in Washington with budget of $1200 maximum for 6 months. The desired move in data is April 12th, 2023. The name of people who book this room is James Smith. The email address is buckeye.foobar@gmail.com.": 0,
        "Select a room in the closest property to the bristol school of acting that cost less than $300 and check the availability.": 0,
        "Find a lowest priced  Student housing near Liverpool International college which has been priced between 100 to 300 pound and has private bathroom.": 0,
        "Find a property in London with Bike Storage and Gym facilities with lowest price.": 0,
        "Add to my wishlist the most expensive option to rent in New york": 0,
        "Find private room accommodation rentals near University of Oxford.": 0,
        "Find a cheapest accomodation near Tokyo International University for moving in July and moving out in December and which provides private room with wifi and laundry services.": 0,
        "book a Group Enquiry of 10 student in the university of New south wales, Australia with AUD 100-500 per month budget, from Apr 8th, 2023 to Match 30th, 2024. Name: John Brown, phone: 3324456543, email: Johnbrown@gmail.com": 0,
        "Find a property near American University with lowest price and add to wishlist.": 0,
        "What is the entire place to rent closest to Oxford school of english that is only available to students": 0,
        "view cheapest apartment available for student in the university of Leeds with WIFI and cleaning services.": 0
    },
    "fedex.com": {
        "Look up tracking information for shipment #3023858502": 0,
        "Calculate shipping cost for 4 pound package from Texas to New York.": 0,
        "Track freight shipment in the US with reference number 3345654345, account number 344565432, post code 44912 shipped on march 31st.": 0,
        "Find the closest drop off location to zip code 90028": 0,
        "Find a staffed FedEx location near zip code 10019 to return a package": 0,
        "check large printing cost for Architecture, Construction & Engineering in paper size 18*24, full color in portrait with left edge binding.": 0,
        "Calculate shipping rates for 2 medium box package with 25 pounds weight each shipping tuesday 28th March from New York to London.": 0,
        "Navigate to the English Brazilian FedEx site.": 0,
        "Calculate the shipping rates for a 10 pound package from Miami, FL to San Francisco, CA": 0,
        "Order free shipping supplies": 0,
        "Get time for latest drop off from FedEx at Dollar General store near 49103.": 0,
        "Find Backlit Poster with 24x36 dimension of paper.": 0,
        "Schedule a one-time pickup for today for a package. Pay with mastercard 4564456745689874, cvv 265 expire at 01/26.": 0,
        "Find jobs in Retail positions in United States.": 0,
        "Find out how to schedule a recurring pickup": 0,
        "calculate rate for LTL class 50 food shipment with 2 5000lb in cartons worth $20000 with residential pickup and delivery from Chicago to Kansas city on March 30th.": 0,
        "Calculate a Fedex Ground shipping rate for a 3 pound package from zip code 10019 to zip code 90028.": 0
    },
    "redfin.com": {
        "Find a premier real estate agent in St Augustine, FL.": 0,
        "Browse homes for sale in San Diego, CA that is under 1 million dollars and has at least 3 bedrooms.": 0,
        "Find the latest 2 bed and 1.5 bath apartment listing for rent in New York.": 0,
        "Fina a real estates agent job in Atlanta Georgia and apply.": 0,
        "Find the cheapest condo in New York to buy which has 1 bed and 1 bath.": 0,
        "Look up a list of rentals available in zip code 85747 with 3+ bedrooms, sorted by lowest to highest price": 0,
        "Find the cheapest place for rent in Koreatown, Los Angeles, CA that is under $3000 and has at least 2 bedrooms.": 0,
        "Calculate what a 30 year fixed rate mortgage monthly payment would be for a $500k home purchase with $100k down in zip code 85747": 0,
        "Calculate how much rent I can afford with annual income $130,000 in Chicago, IL.": 0,
        "Calculate the Mortgage of a $500,000 home with a down payment of $200,000 for a fixed duration of 15 years in Houston, Texas.": 0,
        "Find a list of houses for sale in zip code 85747 with a private pool": 0,
        "Look up how much rent I can afford in the zip code 94587 with an annual gross income of $100k": 0,
        "Find a home with maximum monthly payment of $10,000 and add to wishlist.": 0,
        "Find an apartment for rent in Houston, Texas in the range between 1750 to 2750 dollars and sorted from lowest to highest square feet in table form.": 0,
        "Show all the properties available in 10017 Zip code below $300,000 from lowest price first.": 0,
        "Find a list of all properties sold in Bluff, UT within the past 1 year": 0,
        "Find a home for rent with swimming pool and 3 beds in San Francisco.": 0
    },
    "stocktwits.com": {
        "Follow the user @pedrob": 0,
        "Add the top 5 ranked stocks to the watch list.": 0,
        "Follow the user \"WarrenBuffett\".": 0,
        "Add the stocks AMZN and GOOG to your Watchlist.": 0,
        "Show me the news about the top 1 most active symbol": 0,
        "Create a room for AI stocks discussion, with the topic \"Technology\".": 0,
        "Find the current market price of AAPL stock and add it to your watchlist.": 0,
        "Join a Cryptocurrencies public room.": 0,
        "View the chart for the stock TSLA and adjust the time frame to show the past 6 months.": 0,
        "Create an alert for Tesla stock for when the price drops below $300": 0,
        "Search for the Earnings taking place on Thurday, March 23, 2023.": 0,
        "Find the top ranked stocks and filter them by most active.": 0,
        "Add AMC stock to a watch list.": 0,
        "Show me the liked posts from a user that has recently posted about btc": 0,
        "Find the top ranked stocks and filter them by most watchers.": 0,
        "Create an alert for the BUD symbol": 0
    },
    "healthline.com": {
        "Search for an article titled \"30 High Protein Snacks that are healthy and portable\" and print it out.": 0,
        "Compare two pescatarian diets for eating healthier": 0,
        "Find the recommended dosage for Vivitrol": 0,
        "Play a video in the mental health category.": 0,
        "Sign up for the Gut Check Challenge with the email address of buck19915@gmail.com.": 0,
        "Take a newsletter subscription with my email id (buckeye.foobar@gmail.com) for Allergies and asthma, Anxiety and depression, nutrition, diabetes, breast cancer, and migraine with email id.": 0,
        "Browse articles for breast cancer treatments.": 0,
        "Find me sweet snacks for vegetarians that can be done in more than 5 minutes": 0,
        "Show me the causes and risks for bipolar disorder.": 0,
        "Join the mindful eating challenge.": 0,
        "Find an article about treatment options of acid influx and vote the article as helpful and informative.": 0,
        "Take a weight management quiz to find a motivating article for a non excersizing, mostly eating out and can't control portions and cravings, and who has a strong support system, enjoys traveling, loves family time and cooking.": 0,
        "Find me a gluten-free diet to lose weight for a pregnant woman": 0,
        "Browse a list of CDB product reviews.": 0,
        "Find an article about type 2 diabetes and mark it as helpful and informative.": 0,
        "Find a vegan diet to lose weight": 0,
        "What are the side effects of amoxicillin?": 0,
        "Find healthy savory vegan snack recipes which can be cooked within 5 minutes and contain a high level of protein.": 0,
        "Find a list of topics about sleep disorders.": 0,
        "Show me information about treatments for IBD": 0,
        "Find an easy-to-follow evidence-based nutritious vegetarian diet to lose weight for a diabetic and heart patient, and sign-up to get the results by email buckeye.foodbar@gym.": 0,
        "Find the symptoms of acid reflux.": 0,
        "Find the highest-rated primary care female doctor specialist in internal medicine in Milwaukee, who is available tommorrow and accepts Cigna insurance.": 0
    },
    "apartments.com": {
        "search for senior housing in Boston, MA with two bathrooms and with a virtual tour.": 0,
        "Find the community Amenities of a townhome for rent in Spring": 0,
        "Calculate rent for income of $14000 and budget of 30 % of income in Houston, TX.": 0,
        "Add three cheapest condos in New York to Favorites.": 0,
        "calculate and search rent for a $6000 monthly income with 30% rent budget near 90012 area.": 0,
        "search for 3 bedroom condos with 2 bathrooms within $1500- $2500 range in NYC.": 0,
        "Find a Single-Family House for Rent in Houston, Tx with 1 bed": 0,
        "Search for rentals in Corning, CA with a maximum price of $1500.": 0,
        "Add Elevate at Chicago IL to Favorites and show virtual tour.": 0,
        "Show apartments with swimming pool in Chicago IL.": 0,
        "Find Ohio City apartments with parking, fitness center and elevator.": 0,
        "Check the Rules and Regulation in Kentucky for Landlords and Tenants.": 0,
        "search for the lowest apartment in Detroit for student": 0
    },
    "babycenter.com": {
        "Find the best baby registry for the first breastfed girl child, and get me all the choices with neutral colors and gear that is good for traveling, and all products should come with a long return window, low prices, and discounts.": 0,
        "Find popular baby names for a boy and sort in A-Z.": 0,
        "What are the newest Getting Pregnant groups?": 0,
        "Calculate my next menstruation date with my last circle being on 16th March for 22days.": 0,
        "Search and join a group about diabetes": 0,
        "What are the similar names to the name carl": 0,
        "Show me community posts about pregnancy fever from the past 30 days": 0,
        "Show me the popularity in 2015 of the current most popular baby girl name": 0,
        "What is the chinese gender prediction for someone who conceived in may at 22 years old?": 0,
        "search Hebrew biblical name for boys that begins with letter J": 0,
        "Find and show information about an African name that starts with A and ends with U that is not on the top 100 names": 0,
        "Find the Age-by-age guide to feeding your toddler less than 2 years": 0,
        "check out the best beds available for toddlers": 0,
        "What are the community guidelines for the Debate Team group?": 0,
        "Show me the best infant car seats": 0,
        "Find the Vaccine schedule from Birth to 15 Months": 0,
        "Predict the height for a 8 year old boy that s 50lb and 4', and mother is 5' and father is 6'": 0,
        "search for Good sources of potassium for toddlers": 0,
        "Find the price of Best Organic twin mattress for kids": 0,
        "Show me only the top 100 baby boy names": 0,
        "Find the course curriculum for Meeting physical milestone through play and download course pdfs": 0,
        "Calculate the due date for someone who had their last period on jan 23 and has a 30 days cicle": 0,
        "Calculate Pregnancy Weight Gain for a 5 weeks pregnancy with a 169lb weight before pregnancy and a 175lb after pregnancy with a 5.6ft height.": 0,
        "React with a heart to a comment regarding baby bathing from the past year": 0,
        "Find the best baby blanket products for baby's sleep made from muslin, and tag the article as helpful.": 0,
        "See the prediction about the girl child's height, whose current height at seven years is 4 feet and whose weight is 55 lbs, her mother is 5 feet 2, and her father is 5 feet 8.": 0,
        "Find the Fertile Days assuming last period starts at March 8th.": 0,
        "What are my fertile days if I have a 22 day cycle and the first day of my last period was april 3?": 0
    },
    "coursera.org": {
        "Register to watch the webcast on developing Career ready student. My name is John Doe. My email is johndoe@gmail. I worked at UAI with a job title of Accounting": 0,
        "Explore courses related to Psychology.": 0,
        "search for a beginners course for data analyst in computer science looking for advertisement skills.": 0,
        "Apply to get the Job Skills of 2023 Report eBook. Name: John Doe, Job: Accounting, Email: Johndoe@gmail.com, Phone number: 234567890, Institution: University of Michigan, Primary Discipline: Accountin\ng": 0,
        "Enroll in an advanced course offered by deeplearning.ai.": 0,
        "search for a free business course that covers advanced accounting and lasts between 1 and 3 months.": 0,
        "Check the requirements for Admission for Bsc Computer Science in the University of London": 0,
        "Find a course that provides a certificate of completion in the Data Analysis field.": 0,
        "Find a list of free beginners health courses.": 0
    },
    "usnews.education.com": {
        "Find nursing master's programs in Iowa with the highest enrollment": 0,
        "Filter undergraduate programs in Mechanical  Engineering which offer Doctorate with tuition less than $50,000 in Illinois.": 0,
        "Save the first article on the homepage slider": 0,
        "Find out the application fee for Harvard": 0,
        "Find a quiz to help in choosing a College Major.": 0,
        "Show me a list of graduate Chemical Engineering Programs organized by ranking.": 0,
        "Browse the Best High Schools ranking.": 0,
        "Show me a list of health related courses sorted by lowest price.": 0,
        "Find need based undergraduate scholarships for African American females from Arizona who are applying to Arizona schools": 0,
        "Find the best ranked Asian university for arts programs": 0,
        "Add Princeton University to a list of favorite schools": 0,
        "Find and compare the top three best ranked business schools for MBA finance": 0,
        "Look up UCLA": 0,
        "Find highest ranked part-time law programs in California for a LSAT score of 140": 0,
        "Find colleges with a microbiology major located in China.": 0
    },
    "dmv.virginia.gov": {
        "Find information on how to request a Police Crash Report.": 0,
        "Find the procedure to apply for Hunting and Fishing Licenses": 0,
        "Start the process to renew a vehicle registration": 0,
        "Find out the next date  when the dmv  mobile office will be in highland?": 0,
        "Show Teen Driver Safety program information.": 0,
        "Submit request for vehicle registration renewal.": 0,
        "Find the requirements and Exemptions for emission Inspection": 0,
        "Find a study guide to practice for the driving test.": 0,
        "Find a DMV center in Richmond": 0,
        "Schedule an appointment for motorcycle Knowledge test at 8:30 AM on Apr 18 at the Abingdon office. My name is James Smith, email is abac@abc.com and mobile phone number is 888899778.": 0,
        "Browse the page with information about driver license eligibility for non residents.": 0,
        "Find out how to transfer the title of vehicle when the owner is deceased.": 0,
        "Find information about Crash Investigation classes.": 0,
        "Open page to schedule an appointment for car knowledge test.": 0,
        "Search the list of forms for drivers.": 0,
        "Find the emergencies section in the practice test for a motorcycle license": 0,
        "Find a driver training school in Dublin": 0,
        "Find the guidelines for personalized plates": 0,
        "Find and download form for Customer Concern Report.": 0,
        "Find the late fees for car registration renewals": 0,
        "Find the Driver License Eligibility Requirements": 0,
        "Go to the Renew Vehicle Registration online service.": 0
    },
    "drugs.com": {
        "Show me the most helpful review for clonazepam": 0,
        "Browse the natural products database.": 0,
        "Find the Drug Interaction Report for viagra and alcohol": 0,
        "Show side effects of Tamiflu.": 0,
        "Browse Humira dosage information.": 0,
        "Show the list of Medications for Anxiety": 0,
        "Check drug interaction for melatonin and Folate Forte.": 0,
        "Check the interaction between Novolin N and Novolin R.": 0,
        "find the interactions between Eulexin and hepatic dysfunction.": 0,
        "Find the side effects of taking Montelukast": 0,
        "Identify a pill with pink color and oval shape with 894 5 number on it.": 0,
        "Print the Tylenol Side Effects page": 0,
        "Show me the latest FDA alerts.": 0,
        "Find the risk Summary of Metformin prescribed for a Pregnant woman.": 0,
        "Find available medical apps.": 0,
        "Find the alternative alternative to the prescription drug \"Valtrex\" and compare prices at different pharmacies.": 0,
        "Display the search results for pill 123456, white and round.": 0,
        "Identify the pill with imprint M366.": 0,
        "Find the page with information about ibuprofen interactions.": 0,
        "Show me the page with information about Adderall side effects.": 0,
        "Find the Alcohol/Food Interactions of the drug Allegra": 0,
        "Find information regarding Hypersomnia.": 0,
        "Find drug Paracetamol and its side effects.": 0
    },
    "tiktok.music": {
        "What are the romantic reggae musics from BCD Studio that can be used in tik tok series in andorra": 0,
        "Open the list of popular products in the desktop computer category in the last 30 days.": 0,
        "Show me the trending songs in canada for the last 30 days that are approved for business use": 0,
        "Play a song from the rock playlist.": 0,
        "Use a tense music from BCD Studio in tik tok video editor": 0,
        "Find the chill musics for tik tok commercial use in belgium from the artist TimTaj": 0,
        "Open the click analytics for a top ad in the fitness category.": 0,
        "Open list of creators with more than 10M followers.": 0,
        "Get keyword insights related to games.": 0,
        "What creators are trending now on australia that have brazil as the audience region": 0,
        "Play a rock music from the artist zukisuzuki that can be used for tik tok series and usable  in helo, topbuzz.": 0,
        "Find the popular songs for the last 30 days that are new to top 100 and approved for business use.": 0,
        "Browse list of tiktok series songs longer than 60 seconds.": 0,
        "Show me the tik tok series playlist from brazil": 0,
        "Browse the best Australian food songs.": 0,
        "Show me some creative strategies for effectiveness.": 0,
        "Show me the performance analytics for the most popular product.": 0,
        "Search the list of top 100 hashtags in the last 30 days.": 0,
        "Search for an electronic song that has the word dance on its name for tik tok commercial use, it has to be over 60 seconds": 0,
        "Find and show me the analytics for the top trending educational hastag in egypt in the last 120 days that is new to top 10": 0,
        "Find me happy and food themed music in australia that don't last long than 20 seconds": 0
    },
    "nba.com": {
        "play the video where Larry Bird made his NBA debut vs the Houston Rockets.": 0,
        "Find a medium Devin Booker jersey and add it to the shopping cart.": 0,
        "Browse the list of women's Nike jerseys over $60.": 0,
        "Show me the statistics for assists per game.": 0,
        "Play the latest video from NBA TV.": 0,
        "check the New York Knick 2021/2022 season stats per game in game split on regular season.": 0,
        "Find the current league leader in total blocked shots.": 0,
        "Open the league pass schedule for the Boston Celtics.": 0,
        "check the best seat available below $500 for purchase to Chicago Bulls vs Charlotte Hornets on Mar 31st with wheel chair accessibility.": 0,
        "Find Atlanta Hawks game tickets.": 0,
        "Look up the schedule and find the very last game of the current season(March)\n.": 0,
        "Find Devin Booker's highest scoring points per gameplayoff run.": 0,
        "Find the current league leader in Assists Per Game.": 0,
        "View the latest NBA power rankings to see which teams are performing the best.": 0,
        "check all the $200 seats available for1 ticket purchase to Denver Nuggets last game in week 23.": 0,
        "Find out how many assists Chris Paul has been averaging in the current season.": 0,
        "search for Los Angeles Lakers Group Tickets Interest Form.": 0
    },
    "recreation.gov": {
        "Check permit availability for a group of 4 in Brooks Camp, Katmai National Park on May 22": 0,
        "Add to cart one Private  Vehicle Pass for Yosemite National Park for April 30, for License Plate number 12345 and Zip Code 94587": 0,
        "Find a day use area for picnicking for 20 people in Tennessee.": 0,
        "Find the next available date for Albion Basin.": 0,
        "Find parks In Arizona.": 0,
        "Check permit availability for Bryce Canyon National Park.": 0,
        "Find the next available dates for Alley Creek Camp.": 0,
        "Find campgrounds from April 1st to 4th 2023 that are available at Illinois for 2 adults and 2 kids.": 0,
        "Find day use areas near New York with best mobile coverage": 0,
        "Find historical tours in Washington DC in May which are available for booking": 0,
        "Find the park that offers the cheapest paddling permits.": 0,
        "Find a day use park that offers horseback riding near Nashville.": 0,
        "Open the most helpful 5 star reviews of Alpine Ridge.": 0,
        "Find highest rated accessible tent camping in Kansas between April 13-20": 0,
        "Browse Brooken Cove 5 star reviews.": 0,
        "Show me the rules and cancellation for Alley Spring.": 0,
        "Find a park to camp in that is wheelchair accessible and has boat sites.": 0,
        "Find Snorkeling and Diving activities in Oregon": 0,
        "Find the app for ios.": 0,
        "Show East Lake tent campsites in Hiawatha National Forest that are available from May 22 to 24, 2023 with waterfront.": 0
    },
    "macys.com": {
        "Add a men's T-Shirt that is in large size with a stripe pattern, short sleeve and under the Best Sellers group to the cart.": 0,
        "look at top rated size 5 women Leather Sandals from MICHAEL Michael Kors within $50 to $100.": 0,
        "Find baby shoes under 20 dollars and rated 5 stars.": 0,
        "Check the details of order 12345 with email 12345@gmail.com": 0,
        "find marriage registry with name JANE DOE": 0,
        "Find the cheapest anklets in a clearance sale for under 10 dollars and move this to the shopping bag.": 0,
        "Add to my bag one men's slim jeans of size 26*29": 0,
        "Search for boys infant pajamas below $40.": 0,
        "Filter handbags to evening bag that is blue, embellished and costs less than $50.": 0,
        "Find a top-rated best-seller unisex building toy for a 5 to 7-year-old.": 0,
        "Find a black and a brown top for work in the trending section and add two tops  in the shopping bag.": 0,
        "Creat a searchable list named New Home and add a cheaest recliner chair to that list.": 0,
        "checkprice of silver engagement rings with 1-2 cttw  available for purchase": 0,
        "Show me the list of kitchen products made of aluminum on sale.": 0,
        "Purchase a Macy's E-Gift Card worth $50 with birthday wish message \"Happy birthday, wish you many more years to come\" to christene (christenson@gmail.com) from Shak": 0,
        "Shop for 2020 made dry red wine made in Italy priced between 15-20 dollars and add 5 bottles to the cart.": 0
    },
    "tripadvisor.com": {
        "Save to my trips a restaurants in Johannesburg with vegan options.": 0,
        "Find the best rated hotel room for 2 adults and 1 child (aged 9) in Sedona, AZ for June 21-June 28": 0,
        "Find Italian restaurants in New York City near Central Park.": 0,
        "Find the lowest priced Vacation Rental in Quepos, Costa Rica for 3 guests between July 16-20 that is Pet Friendly": 0,
        "Find a one-way nonstop flight between San Fransisco to San Diego on July 1, on United Airlines for 2 adults and 1 \nsenior, and view the deal of the morning flight.": 0,
        "Open the page to create a review for Hotel Xcaret Mexico.": 0,
        "Find cheapest flight from Toronto, Canada to New York City, USA for 1 adult.": 0,
        "Reserve a table at highly rated restaurant in Paris for 2.": 0,
        "Write a 5 star review for Pizzeria Mozza in Los Angeles.": 0,
        "Find a list of restaurants in Big Sur, CA with outdoor seating": 0,
        "Book cheapest available tickets of Eiffel tower in Paris for 2 adults.": 0,
        "Hire a trip designer for Egypt during 1 to 4 July for a family vacation for 2 adults and a 8 year child with a budget between 4k to 6k. The trip should include mus\nt-see attractions, local cuisine, history, shopping, and local traditions as an adventure.": 0,
        "Find a vacation rental with 2 bedrooms and 2 bathrooms for the 15 to 20 June period, in Kanha National Park, India, and book the cheapest one.": 0,
        "Find the cheapest 2 rooms in a five-star hotel with a pool in Jaipur for 4 people with a check-in time of June 2, and check-out of 5.": 0,
        "Find hotels in Orlando from April 2nd to April 8th for 2 adults and 1 child aged 4 years.": 0,
        "Find the shortest Duration Rail Tour in Tokyo, Japan between Aug 13-18": 0,
        "Find the #1 rated \"Thing to do\" in Sedona, AZ": 0,
        "Find a restaurant in San Francisco which serves Kosher food and high rating.": 0,
        "Find a Hotel in New York City with lowest price possible for 2 adults this weekend (April 1st and 2nd).": 0,
        "Find an Indian restaurant for dinner in Los Angeles, order online from the top restaurant, and save this to a list named Los Angeles.": 0,
        "Find a Villa in Egypt for vacation rental": 0,
        "Find the recommended list of things to do in Switzerland.": 0,
        "Find a 4 star Hotel at April 09 for 2 days in Toronto, Canada.": 0
    },
    "shopping.google.com": {
        "Find the cheapest snow colored Google Pixel 7 with 128gb storage that can be bought on google": 0,
        "Look for reviews of a Nest Hello Video Doorbell and filter by 1 star ratings": 0,
        "Create a list of drip coffee makers that are on sale and within $25-60 and have a black finish.": 0,
        "Look for price comparisons of Pokemon Go - Elite Trainer Box": 0,
        "Search for running shoes for men and filter the results to show only those that are available in size 11.": 0,
        "Search for smart TVs with a screen size of 55 to 65 inches and filter the results to show only those that have a LED display.": 0,
        "Find best reviewed 27\"-32\" Samsung or LG computer monitors nearby which have 4k, IPS display": 0,
        "Find size 8, black running shoes for men by Nike which are rated four stars and above and are currently on sale": 0,
        "Compare prices and find cheapest total price for Granitestone Sandwich Maker from stores which offer free delivery": 0,
        "List one star reviews for best reviewed iPhone 14": 0,
        "Create a product collection called \"Future Birthday Gifts\"": 0,
        "Find electric coffee grinders and filter the results to show only those with a capacity of 4 - 6.4 oz": 0,
        "Identify Nike Air Women's size 6 cross training shoes that offer free return.": 0,
        "Look for a White PlayStation 5 Console and save it": 0,
        "Find wireless earbuds by Samsung and sort the results by Review Score.": 0,
        "Find pet food for cats and sort the results by price, least to most expensive and from Chewy.com": 0,
        "Compare prices for a Samsung Galaxy S22": 0
    },
    "bestbuy.com": {
        "find a silver steel watch with touch screen, water resistance, touch screen and google assistance support for currently on sale": 0,
        "Search for NordicTrarck with the lowest price": 0,
        "search for 33 to 49inch Qled gaming monitor with 240hz refresh rate that is within $1000 to $2000": 0,
        "Browse 8K Samsung TVs that are open box.": 0,
        "Buy the highest-rated physical birthday gift card of 50 dollars and add 2 gift cards to the cart.": 0,
        "apply for a retail sales associate jobs within 5 miles to 20001": 0,
        "Find and save a low-cost 30-inch digital display induction cooktop with auto shut off and hot surface indication.": 0,
        "Find a store near zip 30010 that provides authorized apple services for imacs and  make this one  my store.": 0,
        "Check the speccification of the best selling HP FHD laptop with 12gb ram and core i7 running on windows 11": 0,
        "buy a $100 best bu gift card for a birthday": 0,
        "As a Verizon user, finance a new blue iPhone 13 with 256gb along with monthly apple care": 0,
        "View the speakers that are bluetooth and wireless and filter the results to only show models that are on sale and cost less than $50.": 0,
        "Discover the trade-in value of my intel 7th generation i3 windows 10, hp laptop in fair condition,  which has 8 GB memory and can be powered on, proceed for the in-store trade-in.": 0,
        "search for new internal M2 Samsung ssd drive within $25 and $200.": 0,
        "Schedule a repair service for my gaming console closest to the zip code 10001 on March 24, anytime after 6 pm.": 0,
        "check trade in value for a gray galaxy s20 5G (Verizon) in good condition for an open box Samsung galaxy s21 plus.": 0,
        "Add a $50 Uber gift card to the cart": 0
    },
    "trip.com": {
        "Find highest rated attraction in Phuket on April 15 and book tickets for 4 adults, and 2 child.": 0,
        "Select a high speed train ticket with a departure time before 23:00  from Shanghai to Beijing.": 0,
        "Find the earliest departure round-trip flight from New York City to Bangkok for travel dates between Jun 1st and Jul 15th.": 0,
        "Find the cheapest 3-star hotel with a guest rating of 4 stars for booking two rooms in Pune, India, for 4 Adults and one 4 year child, near the airport with a check-in date of March 26 and checkout date of March 28.": 0,
        "Book a first class flight from Hong kong to Taipei leaving April 13 and returning April 14": 0,
        "Book a rental car in LAX for 3 days starting on May 1st with a pick-up time of 10 AM and a drop-off time of 2 PM.": 0,
        "Book a cheapest bundle and save option for 2 adults from Ahmedabad to Dubai on April 5 with free cancellation options, hotel should be a 3 star near Burj Khalifa with guest rating above 4, one night": 0,
        "Browse nonstop flights from London to New York City from Jun 1st to July 15th.": 0,
        "Search for hotels in Tokyo for the weekend of May 19th that offer free breakfast and airport shuttle service.": 0,
        "Show me Today's Top Deals on Hotels": 0,
        "Search for hotels in Miami Beach for the weekend of Apr 21 for 2 guessts  that are good for a romantic trip.": 0,
        "Find hotels with breakfast included in las vegas for 3 adults to stay in two rooms from April 10 to april 23": 0,
        "Find a Hotel in New Yark for the dates Wed, 15 Mar to Thu, 16 Mar 1 room for 2 Adults providing 1 Bed with Breakfast and the rent payable at Hotelwith Instant confirmation and Free cancellation": 0,
        "Book a train to seoul from busan  on April 1 after 10 am in the name of Agent Smith, born in Australia on January 1, 1988, and contact number is 710 101 111 with email id - agent.smith@matrix.com.": 0,
        "Find and book the cheapest flight from Mumbai to Toronto on March 28, which includes carry-on bags with minimum stops in Economy class.": 0,
        "What are the Nearby Attractions from the top rated park attraction in hong kong?": 0,
        "Add the lowest in price Amusement park attraction in Seoul to my favorites": 0
    },
    "cars.com": {
        "Find a highest rated dealer for Cadillac with rating above 4 star within 20 miles of zip 60606.": 0,
        "Find electric cars with a maximum price of $50,000 within 50 miles of 10001.": 0,
        "Find a used cheapest 8 cylinder bmw  made between 2005-2015 and priced from 25,000 to  50,000 dollar with mileage less then 50,000 miles or less.": 0,
        "Find a cheapest hatchback car listing in Madison which has red interiors with heated seat option and premium sound system.": 0,
        "Find service and repair for a 2022 Audi e-tron.": 0,
        "Find recalls for the Alfa romeo 4C": 0,
        "Compare the Acura CL 2003 with the ILX 2022.": 0,
        "Find the Recall information provided by National Highway Traffic Safety Administration for Chevrolet model bolt EUV for the year 2022": 0,
        "Find the seller info and seller's notes about used car model 2013  BMW 135 with a max price of $4000": 0,
        "Calculate the estimated car loan payment amount for an average credit-rated person for a 15,000-dollar car with a down payment of 2000 dollars and loan tenure of 48 months in zip 65215 and shop for the lowest priced car.": 0,
        "Compare Audi A7 with Audi A6 both made in 2023 and hide similarities.": 0,
        "Find me the cheapest Dodge Ram 1500 within 50 miles of 21122": 0,
        "Find used audi 100 sorted by best deal.": 0
    },
    "stubhub.com": {
        "Find out how to transfer NFL tickets to a friend.": 0,
        "Book 4 tickets in upper  for any Kevin Hart show in Brisbane, Australia, before 30 March, view tickes prices with estimated fees.": 0,
        "Browse BlackPink tickets in Mexico on Apr 26, show prices with fees.": 0,
        "Find Taylor Swift's concert and select a ticket.": 0,
        "Find upcoming celine dion concerts happening and if any show is happening in france book 3 golden circle paper tickets. Show price with fees when booking.": 0,
        "Find tickets of Taylor Swift event in Las Vegas this month and book 2 lowest priced aisle seat.": 0,
        "Find a NOFX ticket for a show in Austin, Texas on April 23 for 1 person.": 0,
        "Start the process to purchase a gift card.": 0,
        "Find NHL events occurring in Boston.": 0,
        "Find and purchase two aisle seats for the Adele concert in Las Vegas on June 16th.": 0,
        "Check parking available for Bad Bunny concert.": 0,
        "Browse floor tickets to the Los Angeles Lakers vs Memphis Grizzlies game on April 22nd.": 0,
        "Search for four VIP tickets for the Harry Styles concert in Australia on Jul 8th.": 0,
        "Find Miami Heat away games next week in New York and book 6 tickets in club gold seating area and book the lowest priced.": 0,
        "Find $100 egift card which has Happy Birthday on it for myself and add to cart.": 0,
        "Show theatre events for Las Vegas and select one.": 0
    },
    "thumbtack.com": {
        "Get the weekend wedding first dance lessons in my home at zip 10005 for the beginner in Latin dance for a group of 3-4 people with no choreography or song preferences, and contact for prices on my phone number 5214586525.": 0,
        "Get a cost estimate in zip 89116 for the repair of a water-damaged iPad mini that is not turning on at the serviceman's location on May 6 or 7 late afternoon.": 0,
        "Find a remote resume writer with a cover letter for an outdated resume for a senior with a manufacturing background, check the availability on April 20.": 0,
        "Get a free cost estimate for a house cleaner": 0,
        "View the profile of a Wedding Photographer near 10203 for a 4 hour wedding on april 13": 0,
        "Find a personal trainer service at 10040 for a 25 year old client aiming to build muscle.": 0,
        "find electricians near 10203": 0,
        "Find linux platform software developers in 10080 who master the python language and java language with web interface project type.": 0,
        "Find a house cleaning service in 10001 on a weekly basis.": 0,
        "Find and contact for price a plumber near 13020 for toilet repair": 0,
        "Find the best weekly morning deep house cleaning services for a two-bedroom and two-bathroom house without a pet in zip 07718.": 0,
        "Check the availability for a service of Lawn Mower repair which does not start": 0,
        "Find remote accountants for individual tax preparation": 0,
        "Find preferably female personal trainers for a client aged 37 in 07055": 0,
        "Request a quote from electrician for repair work on an outlet.": 0,
        "Message the fastest handymen near 13020 available for a full day project": 0,
        "Search for furniture moving companies for moving 1 large item with stairs to load and unload within the same building near zip code 60504.": 0,
        "Find job openings in Thumbtack engineering which are virtual and based in united states": 0,
        "Find mold inspection recommended by professionals for April 26 in 07055": 0,
        "Find a videographer service for concert performance on 10th, April for 1 day and video time of 1 hour, budget around 500 USD": 0,
        "Find a plumber for toilet repair in 10001.": 0,
        "Estimate the cost of a photographer in 07055 for a 4 hour project": 0,
        "Find a private dog training service for aggressive behavior modification like barking and biting near 90011 and book a session for 1-year-old medium sized dog at my home only during weekends.": 0,
        "find landscaper service and get a quote to remove trees and include help to identify items to be removed at my home.": 0
    },
    "linkedin.com": {
        "Search for Bioinformatician job which is remote.": 0,
        "Search for Calico Life Science company and follow, like the first post.": 0,
        "Find Data Entry or similar jobs and save two of them.": 0,
        "Find Customer Support or most related job in New York.": 0,
        "Find LinkedIn Learning page and subscribe for the newsletter.": 0
    },
    "akc.org": {
        "Find an energetic hairless dog with medium barking.": 0,
        "Find a dog groomer for nail trimming within 100 miles of zip 10005 and message the owner of the top one.": 0,
        "Compare a bulldog and a boxer.": 0,
        "Open list of dog agility sport events.": 0,
        "Find an available female Cane Carso puppy with champion bloodlines in Alabama and message the breeder.": 0,
        "Find the average size of a golden retriever.": 0,
        "Find obedience trials in state of New York during the month of May": 0,
        "Compare the breeds Afghan Hound, Akita and Azawakh": 0,
        "Find the playful level of a corgi.": 0,
        "Find a dog hunting test event for the dog in Texas on March 25 and add this event to the google calendar.": 0,
        "Recommend some cute female dog names starting with T": 0,
        "Find agility and obedience companion events for All American Dogs within a 100 miles of Brighton, AL from May 15, 2023 to May 30, 2024": 0,
        "Find a list of articles about vitamins and supplements for dogs.": 0,
        "Find a female Akita puppy in Chicago.": 0,
        "Find AKC judges having last name Williams in the state of Alaska": 0,
        "Find the nearest vet within 50 miles of zip 75228.": 0,
        "Register a purebred dog for a new owner.": 0,
        "Show me the comparison between Affenpinscher and Afghan Hound.": 0,
        "Find the coat type of a beagle.": 0
    },
    "weather.com": {
        "Find the hourly weather forecast for Seattle, WA for the next 24 hours.": 0,
        "Find the 10 day forecast for zip code 90028.": 0,
        "Find out the cold and flu forecast and today's air quality in Champaign, IL.": 0,
        "View the past month's weather history for zip code 10019.": 0,
        "Find the hourly forecast for zip code 90210.": 0,
        "Find the monthly forecast for zip code 90028.": 0,
        "Find out if there are any current air quality alerts or warnings in effect for zip code 10019.": 0,
        "Find the radar map for Los Angeles, CA.": 0,
        "Check the air quality index (AQI) details for Denver, CO.": 0
    },
    "careers.walmart.com": {
        "Look for a temporary job in the corporate business operations at an hourly rate in Sam's club. Show jobs available in Dallas, Texas.": 0,
        "Find the latest full-time salaried Marketing job in Silicon Valley at Walmart.": 0,
        "Find full-time cyber security jobs.": 0,
        "Get an hourly rate-based full-time Walmart store job in New Albany,Indiana and apply to the latest job.": 0,
        "Find the newest temporary job opportunities in technology in Ohio,IL": 0,
        "Search for a job in transportation and if truck driver job is open apply to it.": 0,
        "Show me jobs for MBA & Graduate Internships.": 0,
        "Show me all opening for sam's club jobs": 0,
        "Find jobs available in Atlanta as a software engineer.": 0,
        "Find support services jobs in Bentonville in the state of Arkansas.": 0,
        "Find a job for military personnel in Sams club civil engeering as full-time salaried": 0,
        "Apply for the oldest full time Walmart Store Job available": 0,
        "Search for jobs for nurses in anywhere": 0,
        "Show me jobs in Silicon Valley that pay by the hour.": 0,
        "Find full time jobs with Walmart Health which are updated recently.": 0,
        "Open page with information about Associate Resource Groups for Diversity and Inclusion.": 0,
        "Show the latest opportunities available for new graduates.": 0,
        "Search for pharmaceutical jobs at Sam's Club.": 0
    },
    "uhaul.com": {
        "Browse cargo trailer rates in Chicago, IL to be towed with a 2015 Doge Challenger.": 0,
        "Browse medium sized climate-controlled storage units in Los Angeles.": 0,
        "Update from a 15' truck to a 20' truck and get new quote.": 0,
        "Find the closest U-haul storage location to Anchorage, Alaska that offers small climate controlled storage units.": 0,
        "Find truck rates in Chicago for pick up tomorrow (April 19).": 0,
        "Add Apartment Kit moving boxes to the cart.": 0,
        "Get a quote for a 15' truck rental for pick up in Birmingham Alabama on May 29th and dropoff in Mobil Alabama.": 0,
        "Reserve an indoor storage unit that is medium at a u-haul facility in zip code 90001.": 0,
        "Browse trailer hitches for a 2015 Honda Civic Sedan for pickup at a U-Haul location in zip code 10019 on Apr 19, 2023.": 0
    },
    "glassdoor.com": {
        "Find a guide for career path in Arts and Designs.": 0,
        "Discover the top 4.5 and above-rated companies with more than 10000 workforces with work-life balance in Bangkok, and view the latest jobs in the top-most company posted in the last seven days.": 0,
        "Save a job alert for a job in Oregon in the Parks Department.": 0,
        "Read employee reviews and ratings for Google.": 0,
        "Find and follow Tesla for future job search references.": 0,
        "Find a job as Data Analyst in New York City with salary above $91,000.": 0,
        "View the posted salaries of SE Healthcare.": 0,
        "Create a job alerts for sales positions and also opt for email and other notifications.": 0,
        "Check employee reviews and ratings for Microsoft.": 0,
        "Compare Tata consultancy services and Infosys, view job openings in the higher rated company and then follow.": 0,
        "Find job postings that have a location in Maine and a salary of 50k or higher.": 0,
        "Calculate the salary of an Assitant Store manager in New York with an experience of 1-3 years in manufacturing and rate the accuracy of the result as the right one.": 0,
        "Find out data scientist salary in California for no experienced candidate in the IT industry, view open jobs in the top paying company, and follow the company to get in touch.": 0,
        "Find average salary of Senior Bioinformatician and compare it with the highest paid in different locations.": 0,
        "Check the salary range for a marketing manager position in Columbus, OH.": 0,
        "Find a full-time job as a copywriter within 50 miles of Mumbai posted in the last seven days (as recent as possible) with easy apply option, save the most recent job.": 0,
        "Find job openings for software engineers in Seattle, WA.": 0
    },
    "indeed.com": {
        "Check salaries for Biostatistician and select the company which pays highest and follow it.": 0,
        "Open the burger king interview questions page.": 0,
        "Find entry-level finance jobs in San Francisco that require a Master's degree.": 0,
        "Search for part-time administrative assistant jobs in Miami with a minimum salary of $40k.": 0,
        "View details of the self study online certification from a school rated 4 and above in a forklift through online classes with a duration of 30 to 60 minutes.": 0,
        "Show me Mc Donald's reviews.": 0,
        "Open the job search I've been looking recently.": 0,
        "Look for customer service jobs in Chicago that have a minimum wage of $20 per hour and require no experience.": 0,
        "Look for healthcare jobs in Los Angeles that require a Bachelor's degree and don't require weekends.": 0,
        "Browse home office jobs with salary over 25000.": 0,
        "Find a grocery store cashier job in Florida.": 0,
        "Look and apply if found, a Job in Zoho Corporation in Human resource for a salary above 30k for a master's degree holder.": 0,
        "Find reviews for Calico Life Science and mark a review which is helpful.": 0,
        "Search for remote software engineer jobs in United States": 0,
        "Find remote software engineering jobs with a minimum salary of $100,000 per year.": 0,
        "See if any part-time remote  job is available within 10 miles of Bradley county, Tennessee for entry-level workers and apply the most recently posted one if a job is available.": 0,
        "Find a job to save, posted in the last 7 days in Kohima, Nagaland for a bachelor's degree holder with a salary of at least 25k per month.": 0,
        "Search for nutritionist jobs in Ohio.": 0,
        "Search for a part-time job in the healthcare industry in Essex, which is posted in the last 24 hours posted by an employer, who is willing to pay above 20000 pounds and above and report the recently posted job as fake.": 0
    },
    "ohio.gov": {
        "Find the list of Hunting Equipment allowed by the federal hunting law for hunting": 0,
        "Find the latest COVID-19 Travel Advisory in Ohio": 0,
        "Find the procedure to get the license for Athletic Trainer": 0,
        "Find the paper applicatn for the SNAP program": 0,
        "Find the latest news article about Ohio Benefits and share it on Twitter": 0,
        "find the eligibility to register for voting on online voter registration": 0,
        "Find out how to sign up for Veteran Benefits": 0,
        "Find the Hiring Guide to hire a small scale business": 0,
        "Search for early care and education programs for all programs and step up to quality rating with transportation on Saturday from 6 am to noon in Midland, Clinton county, Ohio.": 0,
        "Find the Eligibility details to qualify for Medicaid. The person looking for it has 1 people in household and monthly household income of 1000 USD and zip code of 32350. The person is not pregnant and older or equal to 18. The person is not receving medicare or not age 65 or older. Neither the person nor his/her spouse ever served/are serving in the U.s.military.": 0,
        "Find out how to view an old tax return": 0
    },
    "health.usnews.com": {
        "Open a list of pediatric dentists in Delaware.": 0,
        "Find Noom Diet recipes, health & Nutrition and experts review": 0,
        "Show me the comparison of best meal kit services.": 0,
        "Within 25 Miles of 96817, find a nursing home that accepts medicare.": 0,
        "Research Nursing Homes that accept medicare.": 0,
        "Look for a hospital in Phoenix that specializes in diabetes.": 0,
        "Find a medicare advantage plan": 0,
        "Find cardiologists in Alaska.": 0,
        "Go to list of high protein based diets.": 0,
        "Find a thoracic surgeon near Omaha Nebraska.": 0,
        "Browse the ranking of best cancer hospitals.": 0,
        "Find a breakfast  recipe from the best weight loss  diet for 2023.": 0,
        "Find the medical review board for Pharmacy.": 0,
        "Find a female physician in Houston, TX who specializes in Cardiology.": 0
    },
    "twitter.com": {
        "Go to my profile and add Bio: \"Explorer and Wanderer\"\n.": 0,
        "Follow SpaceX and like and bookmark the latest tweet.": 0,
        "Start following the @amazon twitter account": 0,
        "Follow the Dallas Cowboys twitter account.": 0,
        "Find Elon Musk's profile and start following, start notifications and like the latest tweet.": 0,
        "Favorite the newest tweet about the super bowl": 0,
        "Search for Football sport topic and follow top 5 people or organizations.": 0,
        "Open the section to create a new message.": 0,
        "Clear all the recent searched topics": 0,
        "Find a video about food and retweet it": 0,
        "Set the top trending topic in news as not interesting": 0,
        "Find Media Tweets by Bill Gates and like the latest tweet.": 0,
        "Retweet the latest tweet from AOC.": 0,
        "Rate a topic from trending topics as something I'm not interested.": 0,
        "Follow Elon Musk on twitter.": 0
    },
    "udemy.com": {
        "Get the highest rated SAP S/4 HANA course rated 4, and up with a duration between 3 to 6 hours for an intermediate, and add this to your cart and checkout.": 0,
        "Search for the newest game design courses in Portuguese with 4.5 stars and up ratings": 0,
        "Find the page with information about Investor events.": 0,
        "Find a AWS certification Software Development related to Amazon EC2.": 0,
        "Find the highest rated best Python courses for beginners.": 0,
        "Find javascript courses popular among beginners.": 0,
        "Add to wishlist a course studenst also bought with a trending Personal Development Course": 0,
        "Add all courses Frequently Bought Together with the most popular Business Course": 0,
        "Find the pencil drawing courses having the rating 5 and sort \nthen them by highest rating": 0,
        "Add the highest rated english java course to my cart": 0,
        "Find Unreal Engine game development courses with 17+ hours.": 0,
        "Search for the newest home workout English courses within 1 hour with subtitles for weight loss for beginners.": 0,
        "What are the beginner favorites startup courses": 0,
        "Show me the latest Public Speaking Courses rated 4.5 or greater.": 0,
        "Sign up for new tutors.": 0,
        "Search for newest Linux Administraion courses with 4.5 rating.": 0,
        "Find  meditation and sound therapy rated 3.5 and up between 1-3 hours for beginners with French subtitles.": 0
    },
    "bbb.org": {
        "View all BBB career job openings in Chicago Il.": 0,
        "Search nearest real construction services for kitchen + bathroom remodeling within 10 miles of Hollywood, Florida and BBB acreditation not necessory.": 0,
        "Get a quote from C and above-rated solar energy equipment company within 10 miles of Miami, Florida.": 0,
        "Find all the locations for the second best rated used car dealer less than 5 miles from New York": 0,
        "Open the reviews for a Mc Donald's.": 0,
        "Show me the reviews for the auto repair business closest to 10002": 0,
        "Open the page to learn more about how to get accredited.": 0,
        "Look for the best rated BBB accredited charity near 12023": 0,
        "Find contact information for a  roofing contractor that specializes in bathroom remodel with A BBB rating near Hillsboro Oregon.": 0,
        "Find the number of scams reported this week for scammers using the name Amazon.": 0,
        "Go to the US page to report a scam or fraud.": 0,
        "Look up if the phone number 555555555 is a scam": 0,
        "Find a  Landscape Contractors near Milwaukee, WI that specialize in fire pits.": 0,
        "Request consultation from a nearest BBB-accredited personal injury lawyer who has a rating of A and above in New York.": 0,
        "Find roofing contractors less than 5 miles from 10002": 0,
        "Fill a form and submit for accreditation in the name of Vito Carlone with business name Mafia services in zip code 60068 and whose email id is vito.carlone@godfather.com and phone numbr is 6571572589. Viro Carlone has been in business for more than six months.": 0,
        "Get directions to the BBB main office in Milwaukee Wisconsin.": 0,
        "Search for cash app scams.": 0
    },
    "pensketruckrental.com": {
        "Find a location for truck rental in Norwood, Massachusetts,then get quote for high roof cargo van needed for picking up on April 12 home applinace from Norwood and returning to the same location on April 13.": 0,
        "Get a quote for a truck to rent on the commercial business for April 7 to 9 to pick up goods from Newark and return to the same location, choose the nearest one for the job.": 0,
        "Get help planning your move by finding Loading & Towing tips": 0,
        "Get a quote for a pick up in Detroit, MI and drop of in Cleveland, OH on April 12th for a 12 foot truck.": 0,
        "Go to the page with information on how to load a moving truck.": 0,
        "View the Truck Side-By-Side Comparison Chart and then select the truck that is good for moving 3-5 rooms": 0,
        "Get a moving quote for a 12 foot truck from Oregon to Cleveland.": 0,
        "Use the Moving Truck Wizard to find the right size truck to move 1 three seat sofa and 1 double bed then start a quote": 0,
        "Find truck rental locations near Dallas, Texas": 0,
        "Locate a cheapest 10 x 10 feet storage rental near zip 02155 with 24 hour access facility.": 0,
        "Show me the comparison between available truck types.": 0,
        "Find Truck Rental services near Seattle.": 0,
        "Check the price for renting a high-roof cargo van to pick up items from Dayton and drop them off at Texas City on March 31.": 0,
        "Find a latest job as a truck driver in Rochester, New York and apply.": 0
    },
    "zocdoc.com": {
        "Find a cardiologist within 50 miles of 96162.": 0,
        "Browse  chiropractors near zip code 90028 who accepts medicare.": 0,
        "Browse psychologists who offer couples therapy.": 0,
        "Find a male Dermatologist who can speak Spanish in Los Angeles, Texas, on March 28, 2023, early morning and book an appointment at 8.30": 0,
        "Schedule a video visit as soon as possible with Dr. Vineet Sandhu.": 0,
        "Find a Metlife Vision plus affiliated Gujarati-speaking male Chiropractor within 5 miles of New York for an in-person visit as soon as possible.": 0,
        "Check reviews of Dr. Theresa Meotti.": 0,
        "Browse dermatologists near zip code 90028 that treats children.": 0,
        "Find an available doctor for in person visit in the morning, who specializes in Urology for kidney stone issues in Miami, Florida, on March 25, and  I am paying the bill myself.": 0,
        "Search for female optometrists.": 0,
        "Find a female Dermatologist in 10001.": 0,
        "Find eye doctors within a mile of 07055 who are available in evening from Mar 13 onwards": 0,
        "Book in-person couples therapy with female doctor within 10 miles of Brooklyn, New York, for myself and my partner with the United Healthcare choice plus plan on March 23, 2023.": 0,
        "Find the earliest appointment for orthopedic surgeon in 10001 who accepts Cigna Medicare Access Insurance and treats pain in spine and back.": 0,
        "Browse dentists who are available in the afternoon.": 0,
        "Book a dentist within 50  miles in Texas City, Texas, on March 30  with Cigna - savings plus plan and book an appointment at 2:30 pm.": 0
    },
    "finance.yahoo.com": {
        "Show me historical data for EUR/USD.": 0,
        "Follow the Microsoft Corporation": 0,
        "Find the most recent press release by NVIDIA Corporation within the last 7 days.": 0,
        "Give a thumbs up to the top comment about Microsoft stock": 0,
        "Find the closing stock price for Tesla on March 17, 2023.": 0,
        "Find the list for High-Yield Dividend Stocks and share it on Twitter": 0,
        "Open chart for BTC-USD.": 0,
        "Create a new portfolio called Tech and add Microsfot.": 0,
        "Show chart of Dogecoin for 6 months.": 0,
        "Check the 5-year performance chart for the S&P 500 index.": 0,
        "Search for the BTC symbol and show me its historical data": 0,
        "Chart the moving average of the Dow 30.": 0,
        "Show information about Most Active Penny Stocks.": 0,
        "Compare plans of Yahoo Finance Plus.": 0,
        "Look up the visitors trend for Apple stock": 0,
        "Follow the list for Most Active Penny Stocks": 0,
        "Find the IPO calendar.": 0,
        "Show Equity Screener for Mid Cap in Healthcare sector.": 0,
        "Find the latest news about Bitcoin.": 0,
        "Find the current stock price and market trends for Apple Inc.": 0,
        "Find price of gold and follow.": 0,
        "Find the page with information about important dates for small business taxes.": 0,
        "Find the hiring trends for Tesla": 0
    },
    "craigslist.org": {
        "Browse apartments with at least 2 bedrooms and 2 bathrooms and a max price of $4000 per month.": 0,
        "Browse job listings for a solar panel installer and hide duplicates": 0,
        "Browse couches for sale, sort by cheapest and search in titles only.": 0,
        "Browse piano lessons and display listings in map view": 0,
        "Show apartments for rent in Indianapolis with 2 bedrooms from least to most expensive.": 0,
        "Browse for pets to adopt and only show listings with images": 0,
        "Find a full time copywriter job in New York City and apply with my details.": 0,
        "Get the email address of anyone who has poted a listing today for theatre tickets for the show A Doll's House within 50 miles of the zip code 10001.": 0,
        "Browse dog friendly vacation rentals that offer air conditioning and a carport.": 0,
        "Browse washing machines for sale and only show listings posted today": 0,
        "Browse Iphone X for sale that are in good condition, has a max price of 400, and search in titles only.": 0,
        "Search for a part-time job as a cashier.": 0,
        "Find the newest garage sale in Phoenix, Arizona, on March 31 and print the details of the garage sale, which is selling old toys.": 0,
        "Find and view contact details of  the newest parking spot for rent in Austin, Texas within 10 miles of zip 78563 and in a budget of 50 to 150 dollars with an air conditioning facility.": 0,
        "Search for a babysitter service.": 0,
        "Show me a list of antiques for sale sorted by oldest.": 0,
        "Browse apartment listings with at least 2 bedrooms and filter search by title only for the search keyword: laundry": 0,
        "Find furnished housing ads with images for rent within 30 days in New York without broker fees, the house should have a minimum of one bedroom and bathroom with an attached garage, choose the lowest price house and print the details.": 0,
        "Find the newest furniture for sale as a list in Chicago by hiding the duplicate ads, show only those who accept cryptocurrency, and save the list.": 0
    },
    "pinterest.com": {
        "Disable the Email Notification": 0,
        "Create a Fitness board.": 0,
        "Turn off the pins I saw today.": 0,
        "Browse male outfit ideas for a beach vacation.": 0,
        "Follow a profile from the low poly category.": 0,
        "Disable Autoplay feature for videos": 0,
        "Get the share link of the pinner Sticker Mania": 0,
        "Download 5 good Christian quotes": 0,
        "Find 2 bodyweight workout routines and save them.": 0,
        "Save on my pins a Halloween costume image.": 0,
        "Create a secret board called \"Home Decor Inspiration\".": 0,
        "Mark all my messages as read.": 0,
        "Create a Quotes board.": 0,
        "Create a board called \"Healthy Eating\" and save one healthy recipe.": 0,
        "Find a recipe for seafood pasta and share it on Twitter.": 0
    },
    "justice.gov": {
        "Browse list of Civil Division forms.": 0,
        "Find press releases by antitrust division in 2022": 0,
        "Find the page with information about hiring people with disabilities.": 0,
        "Show me more information about supporting communities after mass violence incidents.": 0,
        "View US Marshalls top 15 most wanted fugitives.": 0,
        "Find court decisions on the topic of attorney fees in January 2023": 0,
        "Find forms in the civil division related to radiation exposure.": 0,
        "Find DOJ careers and Search Jobs and view the latest job opening.": 0,
        "View the list of forms related to DEA showing 50 forms per page": 0,
        "Find a career opportunity in Attorney.": 0,
        "View the staff profile for the director of  Office of Tribal Justice": 0,
        "Find latest publication of attorney general.": 0,
        "Find legal career openings for summer volunteer law students in the state of New York": 0,
        "Find the list of Attorney Generals of the United States sorted by oldest to newest": 0,
        "Find the contact information for  the oversight office that   has the power to conduct criminal investigations and possible prosecutions.": 0,
        "Show me the 2021 Annual Performance Report.": 0
    },
    "mayoclinic.org": {
        "Find programs offered in Neuroscience Department.": 0,
        "Find florida internship programs in the Mayo Clinic College of Medicine and Science": 0,
        "Find possible causes for the symptoms chest pain which is sharp which is accompanied by  anxiety.": 0,
        "Find tuition fees for M.D. Program.": 0,
        "Show me Diagnoses & Treatment for Female infertility": 0,
        "Find a female MD Cardiologist in Jacksonville, Florida.": 0,
        "What are the Symptoms and causes of fever?": 0,
        "I want to know about the faculty and staff of the airway biology laboratory": 0,
        "Find a doctor for back pain in Rochester": 0
    },
    "landwatch.com": {
        "Look for the latest posted undeveloped land, farm, and ranches under 10 acres in Dallas County, Iowa, and save my search with instant update option for later usage.": 0,
        "Show houses for sale in Maryland with maximum price of $60,000.": 0,
        "Find homes for auction in Wagoner County, Oklahoma, and contact the seller of the tiniest land.": 0,
        "Find Farms land in Wilkes County, NC with lowest price.": 0,
        "Show me the newest farm and ranches in California": 0,
        "Like the newest lakefront property with over 4000 sq ft to buy in Georgia": 0,
        "Find the features of hunting land near Presho, SD": 0,
        "Find an agent in Orange County, FL and contact seller. Name: James SMith, Phone: 8888888888, Email: buckeye.foobar@gmail.com. Content:": 0,
        "Show me land for sale in Nashville, Tennessee": 0,
        "Get owner-financing homesite land for sale in New Mexico, Luna County,  listed in the last 30 days, and contact the cheapest per acre land seller.": 0,
        "Find the contact details of the seller of the land near Rocksprings, TX": 0,
        "Play the video of the most expensive land available for sale in texas": 0,
        "Find a home for action with smallest area in Oklahoma and save it.": 0,
        "Contact the seller of the cheapest hunting land in Georgia": 0,
        "Look for the largest hunting land for auction in Kansas high plain region with mineral rights posted in the last seven days.": 0,
        "Find land for sale with house with 0.21 acres and price 55000 near Charleston, AR": 0,
        "Find popular Ohio Undeveloped Land for sale and contact seller, with name James Smith, phone number 8888888888, and message Visit timings": 0,
        "Search available timberland between 50 to 100 acres in Georgia for sale listed in the last seven days, and contact the seller of the cheapest land with my details with name of James Smith, email address of buckeye.foobar@gmail.com and phone number of 52465235214.": 0
    },
    "movoto.com": {
        "Find a home for rent in Anchorage Alaska for less than 800$/month.": 0,
        "Find a mobile home for sale in Hanover PA, that is not pending.": 0,
        "Find newly constructed homes for sale within 10 miles of zip 11001, with prices between 350k to 550k for a single family with 1 bedroom and 1 bathroom.": 0,
        "Find the lowest price land in Huntsville, Alabama within the 150k to 250 price range and request an in-person visit on March 26, 9 am.": 0,
        "Browse 2 bedroom single family homes under $700k and sort by cheapest": 0,
        "Find plumbing  services in zip 21012, sort it by highest rating, and get a quote from the top service provider.": 0,
        "Find a list of Movoto Agents in Freson California.": 0,
        "Get the quote for a plumbing service.": 0,
        "Find a three bedroom three bath home for sale in Anchorage Alaska with an upcoming open house.": 0,
        "Browse 3 bedroom homes have a pool and favorite one": 0,
        "Show me the list of brokers in Las Vegas.": 0,
        "Search for single family homes in Yorkville, IL with 2 bedrooms and 1 bathroom for a budget between $100,000 and $200,000.": 0,
        "Browse condos under $500k that has 2 bathrooms": 0,
        "Calculate the monthly payment for a home price of $450,800 with 30% down payment and 20 years fixed loan type at zip code 60510.": 0,
        "Find refinance mortgage rate for 15 years for a duplex in zip 00816 with a property value of 475000, a loan amount of 250,000, a credit score of 700-719 and no mortage points.": 0,
        "Calculate monthly mortgage payments for a home in 93727 with 25000 or 6%  down on a $472,450 home at 6% interest for 30 Years Fixed": 0,
        "Find the lowest-priced new apartment for rent with 2 bathrooms and 2 bedrooms within 30 miles of zip 10001 and save the home.": 0
    },
    "hiring.amazon.com": {
        "Find details about the benefits of 20 weeks of fully paid leave.": 0,
        "Find Fulfillment Center jobs within 50 miles of Lincoln, NE, USA.": 0,
        "search regular daytime jobs around 44278 that I can start within a week or two.": 0,
        "Search for night shift job as a associate.": 0,
        "Find available jobs in Omaha and apply to Thu, Fri, Sat shift jobs in fullfilment center if available.": 0,
        "check the most recent full time medical health and safety jobs available in the US": 0,
        "learn more about Apprenticeships & Certifications program": 0,
        "View availible shifts for the highest paying job opening for Amazon Delivery Station Warehouse Associate - Capitol Hill/Seattle, WA": 0,
        "Search for full-time pharmacy customer service jobs available in Phoenix and apply to the latest job.": 0,
        "Find a regular delivery station associate job in New Windsor, Ontario and apply.": 0,
        "Search for a Job as a delivery driver within 100 miles of California, and apply to the highest paying job above at least 22 dollars per hour.": 0,
        "apply for a delivery driving job at Grand Rapids, MI, USA. Name: Nelson Freeman, Email: Nelsonfree@gmail.com, phone: 2034556656. Select \"yes\" for all options": 0,
        "Look for a job state-wise and search for an available job in Madison, Wisconsin, if available, apply for the job and if not apply to any job in Omaha.": 0,
        "search Amazon Pharmacy for available IT full time job in Massachusetts": 0,
        "View the most recent job posting for a full time pharmacy position in the US.": 0,
        "Find a job in Fulfillment Center Warehouse and signup for alerts to email abc@abc.com.": 0,
        "Learn how to get started with the Military Mentoring Program.": 0
    },
    "extraspace.com": {
        "Find the largest size unit at BIRMINGHAM SELF STORAGE AT 720 MONTCLAIR RD and view the size description and size help.": 0,
        "find RV storage near you sorted by location with controlled climate": 0,
        "Find a small storage near Albany, New York location.": 0,
        "Add 2 quantity of 5/16\" 12\"x30 Bubble Wrap to cart": 0,
        "Find large parking spot for an RV in Atlanta.": 0,
        "Find a self storage in 32541 that offers indoor storage and first month free.": 0,
        "Show all the jobs available with extraspace.": 0,
        "Calculate which size storage is required for BMW X3 2020 model.": 0,
        "Add moving box with part number SS-703 to cart": 0,
        "Find a 8x8 storage unit for rent near zip code 90028": 0,
        "Find a STORAGE UNITS IN COLORADO SPRINGS, CO that offeres inclosed vehicle storage.": 0,
        "Find the closest vehicle EXTRA SPACE STORAGE FACILITIES NEAR 32541.": 0,
        "Locate a self storage unit near zip code 60538 that can fit about a dorm room full of items and is climate controlled.": 0,
        "Browse climate-controlled units at a Extra Space Storage Facility near zip code 10019": 0,
        "Finda small Vehicle storage facility in Lincon park Michigan for rent.": 0,
        "Find the additional amenities for the most expensive storage unit near Berkley California.": 0,
        "Find a vehicle storage which is enclosed near Chicago, Illinois.": 0,
        "FIND STORAGE WITH ELEVATOR ACCESS IN WASHINGTON, DC": 0
    },
    "gov.uk": {
        "How to extend the Global Talent visa": 0,
        "Show me the newest information on covid 19 regarding aviation transport": 0,
        "Find the eligibility to get the Adult Passport": 0,
        "What are the most relevant news and communications about vaccination updated after 2023?": 0,
        "What are the benefits and financial support a single person, living in enlang, over the state pension age, unemployed, with no health conditions nor caring for someone with one, can get?": 0,
        "Check if visa is required to work in UK for longer than 6 months in Healthcare as an American citizen.": 0,
        "Show me information about voting for those who live abroad.": 0,
        "Estimate the Income Tax for the current year for a person over the state pension age, who doesn't pay the Scottish Income Tax rate and receives £1,000  per week": 0,
        "Find a latest article of Brexit regarding regulations.": 0,
        "Find the procedure to get the Doctoral Loan and when the application will open for the year 2023": 0,
        "Show information regarding Carer's Credit for Disabled people.": 0,
        "Show me current alerts.": 0,
        "Find eligibility for Jobseeker's Allowance (JSA).": 0,
        "Find a sales executive job in Manchester": 0,
        "Open the page for finding a local court.": 0,
        "Show teaching jobs available in London.": 0,
        "Find the Eligibility to get the child benefit and How it works and how to claim": 0
    },
    "ca.gov": {
        "Access the getting services portal to apply for food stamps in Los Angeles for Jane Martin who is English speaking high school student, with a disability and normal hearing, and lives in 123 Main Street, Los Angeles, CA at Alameda county with zip code 90001.": 0,
        "Look up a bill using the bill number AB1548.": 0,
        "Register to vote in California as a first-time voter.": 0,
        "Show me the profile and contact information for the Office of Administrative Law.": 0,
        "Find an application for low-cost health insurance.": 0,
        "Find out who the representative in the state Senate is for 2043 E Lewis Ave, Fresno, 93701, CA.": 0,
        "Find the eligiblity requiremetns for a Cal grant.": 0,
        "Find out how to apply for a Birth Certificate": 0,
        "Find the fees for a new California driver's license.": 0,
        "Apply for birth certificate.": 0,
        "Find a voting location in Los Angeles county.": 0,
        "Find the requirement to obtain a seller's permit.": 0,
        "Find out the current minimum wage rate in California.": 0,
        "Browse a list of San Jose schools.": 0,
        "Start the process to file for unemployment": 0
    }
}